{"features":[{"feature_idx":0,"name":"text","type":{"dtype":"string","_type":"Value"}},{"feature_idx":1,"name":"label","type":{"dtype":"int64","_type":"Value"}}],"rows":[{"row_idx":0,"row":{"text":"The Trump administration has been getting absolutely pummeled for its refusal to acknowledge climate change, even as it becomes more obvious in our surroundings.On Monday, CNN s Jim Acosta tore Trump s Homeland Security advisor, Tom Bossert, apart in front of everyone for the administration s ignorance. Acknowledging the fact that several massive hurricanes have been ravaging the United States, Acosta cornered Bossert, asking him if Trump and his administration  saw a connection between climate change and homeland security and that the frequency and intensity of powerful storms like Harvey and Irma can pose a problem for future administrations  and if the storms were  giving the administration some pause when it comes to the issue of climate change and homeland security. Bossert was almost beside himself as he said: Causality s something outside of my ability to analyze right now. We continue to take seriously the climate change, not the cause of it, but the things that we observe. Then, Acosta nailed him and the entire Trump administration for their stupidity and ignorance: When you see three category 4 hurricanes all on the same map at the same time, does the thought occur to you,  Jeez, you know, maybe there is something to this climate change thing and its connection to powerful hurricanes?  Or do you just separate the two and say,  Boy, these are a lot of hurricanes coming our way? Bossert, nearly crumbling in front of the entire room of reporters, responded: There is a cyclical nature to the hurricane seasons and I thank the scientists for their forecast on this particular one. They were dead on that this would be a stronger and more powerful hurricane season with slightly more than average large storms making landfall  So we ll have to do a larger trend analysis at a later date. Trump s administration is being challenged by the obvious evidence for climate change, and now they re being called out for it. No one can ignore what is currently happening in our environment, and the enormous impact it will have if Trump s administration doesn t wake up. You can watch Acosta destroy Bossert below:Featured image via video screen capture ","label":1},"truncated_cells":[]},{"row_idx":1,"row":{"text":"NAIROBI (Reuters) - Kenyan police shot dead two people and wounded a third when a crowd tried to storm a police station during an opposition protest against a looming presidential vote re-run, a senior official said.  Around 20 youths attempted to take over the station during an otherwise peaceful rally in the town of Bondo in the southwest county of Siaya, forcing officers to open fire, County Commissioner Josephine Onunga said by phone.  Police also used teargas to break up small demonstrations in Kenya s three main cities - Kisumu, the capital and the port of Mombasa - defying a government ban on rallies in city centers. Hospital authorities said 20 people were injured in Kisumu, an opposition stronghold.  Kenya s supreme court nullified the presidential election in August, citing procedural irregularities and voiding the victory of President Uhuru Kenyatta. The ruling opening the way to a repeat vote on Oct. 26.  But opposition leader Raila Odinga has refused to take part, saying the re-run should not happen until wide-ranging reforms are brought in to prevent another failed vote. The election board has said the polls will go ahead anyway, pitting Kenyatta against six other candidates, none of whom polled more than 1 percent in August.  Odinga told Reuters that he might consider returning to the Supreme Court for clarification on whether the Oct. 26 poll was legal.   As far as we are concerned, that (original Supreme court) ruling is still valid,  Odinga said during a visit to London.  What we are demanding is that the electoral commission should respect the Supreme Court and carry out elections in accordance with the ruling.  He supported protesters  right to demonstrate, he said, but has so far stopped short of calling people onto the streets himself.  In Nairobi, opposition legislators were repeatedly teargassed as they tried to drive into the city center.  We are asking Uhuru s government to ... let us protest in peace and truth and we are saying we want change and we do not want Uhuru and his people,  said protester Mellen Kirumbo.  In Kisumu, protesters reacted angrily when police turned water cannon on them to prevent them from entering the city center.   Our demonstrations have a (valid) basis and are peaceful,  said Odinga supporter Hezron Tirus Aloyo.  We condemn the directive ... on the limitation of our rights to demonstrate.   The Jaramogi Oginga Odinga hospital in Kisumu, named after Odinga s father, said it had admitted 20 patients injured in the demonstrations. Three had gunshot wounds, said superintendent Juliana Otieno.  Martin Kimani, the Director of the Kenyan government s National Counter Terrorism Centre, said the authorities were trying to maintain law and order.   A lot of those provocations or demonstrations taking place are an attempt to create the appearance of a crisis,  he said.  ","label":0},"truncated_cells":[]},{"row_idx":2,"row":{"text":"PC is killing our country. This is called fighting back While counterculture crackpots are working themselves into a lather over the prospect that, in some places, men who think that they re women can go tinkle in the same restroom where a 6-year-old girl is pulling down her panties, one state legislator has decided that it might be time to push back.Indiana State Sen. Jim Tomes, who probably accepts basic biology and believes that people born with a penis are male, proposed a bill that would make it a Class A misdemeanor for trannies to use a bathroom that doesn t correspond to their birth gender.Last week, Tomes uttered the following line that s sure to ignite tempers among the social justice mob:  If you were born a man, then you are obliged to use the males  restroom. What s next? A hereditary monarchy?Anyone convicted of a Class A misdemeanor could face a year in prison and as much as a $5,000 fine.It should be noted, though, that the language in the legislation makes exceptions for janitors, first aid providers, and parents accompanying children under the age of 8.The bill does, however, cover schools. So if it passes and Little Boy Twinkletoes decides that he needs to use the girls  locker room after gym class, then he s facing charges.Indiana saw some action in the culture war last year when the state passed a religious freedom law. That law was widely opposed by American liberals, who hate religious freedom.Via: DownTrend","label":1},"truncated_cells":[]},{"row_idx":3,"row":{"text":"WASHINGTON (Reuters) - Republicans are poised to repeal a U.S. Senate rule that allows minority-party Democrats to block confirmation of Supreme Court nominees, including President Donald Trump’s choice of Neil Gorsuch for the lifetime post. The expected rule change, amid deepening partisanship in a chamber known as “the world’s greatest deliberative body,” is raising questions over whether there could be a future move to prohibit “filibusters” on legislation. Here is how the filibuster has been used and what curtailing it could mean: It is a procedural move, often by a minority of senators, to block legislation or Supreme Court nominations that typically enjoy the support of majority-party senators, in this case, Republicans. According to Senate historians, “filibuster” comes from a Dutch word meaning “pirate.” The practice became popular in the 1850s and was also used by House of Representatives members, until that body became so large with an expanding U.S. population as to require stricter rules governing floor debates. Senate Democrats have gathered more than the 41 votes they need in the 100-seat chamber to mount a filibuster against Gorsuch, a conservative appeals court judge. The first U.S. president is said to have observed that the Senate was created to cool legislation from the hot-tempered House just as a saucer was used to cool hot tea. The filibuster is just such a coolant. When a bill or Supreme Court nomination hits the Senate floor, senators who oppose it can talk until at least 60 senators band together to limit debate. That gives a minority of senators huge power. If a bill or a nomination fails to draw the needed 60 votes, it is effectively killed. The all-time record for a Senate filibuster speech - 24 hours, 18 minutes - was set by the late segregationist Senator Strom Thurmond, who tried unsuccessfully in 1957 to kill a civil rights bill. This week, Democratic Senator Jeff Merkley delivered the eighth-longest speech, against Gorsuch, that was 15 hours, 26 minutes. It is Senate slang for banning filibusters through a rules change by the majority party. In recent years, as filibusters have added to Senate gridlock, there have been threats to execute the nuclear option. Groups of senators, known as “gangs,” have sometimes defused the threats. In 2013, Democratic Senate Majority Leader Harry Reid deployed the nuclear option when he became fed up with Republican filibusters against then-President Barack Obama’s nominees. He changed Senate rules to ban filibusters against the president’s judicial and executive-branch nominees but left it in place for Supreme Court appointees. Now, Senate Majority Leader Mitch McConnell, a Republican, is thought to be ready to expand the ban to Supreme Court nominees. McConnell has told reporters he will not broaden the ban on filibusters to legislation and does not believe Republican senators would want to do that. Some political scientists think Democrats have more to gain than Republicans by ending filibusters on legislation. “My sense has always been that Democratic policy priorities have suffered more from the filibuster than Republican priorities,” said George Washington University political science professor Sarah Binder. That is because Democrats are more likely than Republicans to back an expansion of government programs, which generally requires legislation. But Binder said she could imagine Democrats or Republicans trying to score a major win on an issue central to their constituencies. For Democrats: No filibuster could mean trying to pass another major healthcare or campaign finance reform or new gun controls. For Republicans: Some sort of major deregulation of an industry or changes to “entitlement” programs such as Social Security, Medicare or Medicaid. ","label":0},"truncated_cells":[]},{"row_idx":4,"row":{"text":"(Reuters) - A U.S. appeals court ruled on Friday that an Arkansas law restricting the use of the so-called abortion pill could proceed, overturning a lower court’s decision in 2015 that blocked the law a day before it was to go into effect. The 8th U.S. Circuit Court of Appeals in St. Louis sent the case back to the federal district court in Little Rock, telling the court it must estimate approximately how many women would likely be harmed by the law before the case could proceed further. Planned Parenthood Great Plains, which runs two of the three clinics providing abortions in Arkansas, sued the state in 2015, saying the law would deprive many Arkansas women of their right to an abortion.  The law requires that any doctor dispensing abortion-inducing drugs sign a contract with another doctor who would agree to handle any medical complications that might stem from the drugs. The contracted doctor must have admitting privileges at a hospital designated to handle emergencies related to abortion pills. Planned Parenthood said it ran a 24-hour telephone helpline for patients and that medical complications were extremely rare, but that in those instances its doctors and nurses already have procedures to ensure a patient receives any care they need at a nearby hospital. U.S. District Judge Kristine Baker sided with Planned Parenthood in 2015, concluding that it would not be able to find such a doctor and be forced to stop offering abortion services at its clinics in Little Rock and Fayetteville.  Women in Fayetteville, for example, would then have to make two 380-mile (610-km) round trips to get an abortion at what would be the state’s last remaining abortion clinic, Baker’s ruling said. Ruling that this was an undue burden on those women and that Planned Parenthood would likely win its lawsuit, Baker granted a preliminary injunction stopping the law from taking effect. On Friday, the appeals court overturned that injunction. The ruling said the district court had “abused its discretion” and criticized it for not determining even approximately how many women would be affected. Planned Parenthood could win its case if the court found a “large fraction” of women seeking abortion-inducing drugs would face an undue burden, but the lower court failed to determine this, the ruling said. Arkansas Attorney General Leslie Rutledge welcomed the ruling, saying in a statement that “Planned Parenthood failed to show that the state law is a substantial obstacle preventing most women from having access to abortion services.” Danielle Wells, a spokeswoman for Planned Parenthood Federation of America, said the organization was mulling its next steps, but noted it would have two weeks under the appeals court rules to petition for a rehearing. “This law was written by politicians, and not doctors, and is part of a national strategy to end access to abortion step by step and law by law,” Wells wrote in an email. ","label":0},"truncated_cells":[]},{"row_idx":5,"row":{"text":"Paul Ryan just gave another one of his notoriously lukewarm endorsements of Donald Trump. Intent on walking the thin line between backing his party s nominee and dumping Trump, the speaker of the house has tried to set himself up to come out smelling like a rose regardless of the outcome of tomorrow s election.During a radio interview on Monday, Ryan conceded that, yes, Trump won the Republican nomination  fair and square.  However, when conservative host Charlie Sykes asked if the GOP was now Trump s party, Ryan made it as clear as he could that no, the Republican party does not belong to Donald Trump. It is no one person s party. Donald Trump won the primary fair and square,  Ryan said. As a party leader, as the highest elected official in the party, I have always felt a duty to the process, to democracy, to the primary voter who must be respected. And he won this fair and square,  Ryan added.  But no one person controls this party. This is a bottom-up, organic grassroots party based on conservative principles. What a ringing endorsement to give on the eve of the election. (Insert sarcasm here.)Ryan was slow to endorse Trump and has repeatedly condemned the bombastic billionaire s offensive actions. Ryan denounced the Muslim ban as unconstitutional and declared Trump s attacks on the Mexican-American judge presiding over a Trump University lawsuit as the  textbook definition  of racism. But Ryan just doesn t have the cajones to stand up and walk away from Trump.Sykes asked the speaker about the long list of women who have come forward to accuse Trump of sexually assaulting them after the Access Hollywood tape was leaked, in which Trump bragged about committing sexual assault. Suddenly, Ryan leaped back onto the Trump Train. What do you think helps [Sen.] Ron Johnson and Mike Gallagher and all our candidates across the country more in the closing two days of an election: having party discord and having party leaders snub each other, or unifying the Republican Party and focusing and prosecuting our case against Hillary Clinton?  Ryan responded. What helps Republicans more: infighting or unifying, focusing on Clinton or focusing on our differences as Republicans?  the Speaker continued.  I don t want to harm our team going into the election. I want to unify our team going into the election so as many of our candidates as possible can win this election. Either Ryan can t make up his mind or he is trying to play both sides. Ummm, weasel much?Featured image via Alex Wong/Getty Images and Mark Wilson/Getty Images","label":1},"truncated_cells":[]},{"row_idx":6,"row":{"text":"If you weren t convinced of the fabulousness of First Lady Melania Trump before her 9-day foreign trip, you re certainly aware now. Not only did she dress impeccably but it was obvious that this wise woman put so much thought into what she would wear on this overseas trip. Who wasn t proud to see our beautiful and smart First Lady in appropriate and stylish outfits every day. She won us over in a big way and made the designers who refused to dress her look like schmucks. She needs no one to hold her hand to put together a wardrobe If anything, First Lady Melania Trump proved to the naysayers that you can be beautiful AND smart Well done!Richard Johnson of the New York Post: Melania Trump is proving to the fashion designers who said they wouldn t help her that dressing well is the best revenge.The first lady s trip to Saudi Arabia, the Vatican, Belgium and Sicily   wearing mostly Dolce & Gabbana   was a fashion tour de force that has forced many naysayers in the rag trade to rethink.The list of designers who said they wouldn t dress Melania is long, led by Tom Ford, Marc Jacobs, Zac Posen, Christian Siriano and Sophie Theallet.But Melania has managed to look smashing in dozens of different ensembles, from her white Ralph Lauren jumpsuit on election night to the D&G 3-D floral coat she wore in Sicily on Friday.Defending the former model against critics who harped on the garment s $51,500 cost, the Washington Post s Robin Givhan opined,  Frankly, the floral coat is beautiful. Givhan gets that Melania Trump is one smart woman who coordinated her fashion according to the place she was visiting:Givhan reported:  Clothes can be deeply symbolic. And Trump s choice of Dolce & Gabbana   an Italian brand that has been deeply inspired by Sicilian culture   for a trip to Sicily makes sense. Gabbana also has been quite vocal and enthusiastic in his willingness to associate his brand with the first lady There is a softening, a melting,  stylist Phillip Bloch told me.  Fashion people are fickle and fake. They are starting to see she is a beautiful woman who is married to the president, and it is an honor to dress her. Deliveries to Trump Tower have picked up.  Most days, the lobby is brimming with wardrobe boxes delivered for Melania,  a source told me.  Once she tries on the outfits and decides what she will keep, the boxes come back downstairs. Not since Jacqueline Kennedy has there been a first lady who needs less help. She doesn t need couture. She can buy off the rack, and it looks beautiful,  Bloch said.  She knows her size, and she knows what works on her. She luxuriates in minimal. Read more NYP","label":1},"truncated_cells":[]},{"row_idx":7,"row":{"text":"If there were a contest to describe who the most grotesque, misogynistic and outright awful human beings on the planet are, Donald Trump and those who he surrounds himself with would likely top the list. Not only is Trump wildly sexist and racist, but he comes to the defense of those who abuse others in his name. He has said it at his campaign rallies for those who go after protesters, and now he s come out in full defense of his campaign manager, Corey Lewandowski, who was caught on video brutally grabbing a reporter.Lewandowski, while at a campaign event on March 8th at Trump National Golf Club, grabbed then Breitbart News Network reporter Michelle Fields. She filed charges, and subsequently Lewandowski has now turned himself into the police.You can see here, via security footage, that Lewandowski, without a doubt, grabbed Fields:Newly released security footage of the Corey Lewandowski incident: https://t.co/O5tTflBb5C  Frank Luntz (@FrankLuntz) March 29, 2016Yet, Trump is still jumping to the defense of his abusive campaign manager. Shortly after Lewandowski turned himself in, Trump tweeted out:Wow, Corey Lewandowski, my campaign manager and a very decent man, was just charged with assaulting a reporter. Look at tapes-nothing there!  Donald J. Trump (@realDonaldTrump) March 29, 2016And then he blames the victim like the good misogynist he is:Why aren't people looking at this reporters earliest statement as to what happened, that is before she found out the episode was on tape?  Donald J. Trump (@realDonaldTrump) March 29, 2016THEN he tries to make up an excuse as to why she was being grabbed, turning it back on her:Victory press conference was over. Why is she allowed to grab me and shout questions? Can I press charges? pic.twitter.com/qbW2RjkINX  Donald J. Trump (@realDonaldTrump) March 29, 2016Why is this reporter touching me as I leave news conference? What is in her hand?? pic.twitter.com/HQB8dl0fhn  Donald J. Trump (@realDonaldTrump) March 29, 2016His tweets are literally going from bad to worse.The right thing to do would be to acknowledge the abuse and swiftly fire Lewandowski, but instead he s choosing to victim-shame and back up his brownshirt flunky.It s beyond belief that people still support Donald Trump. Either they are racist and/or misogynistic themselves, hate themselves, or are simply too stupid and likely cannot even tie their own shoe laces. We need to make sure Trump stays as far away from the Oval Office as possible. No matter who, we need to vote blue. Don t let a vote of pure conscience and ego let this country slip into the hands of a man who will most definitely have his hands on nuclear codes. Wake up, people. This race is bigger than ourselves and even our nation. It affects the whole world.Featured Photo by Joe Raedle/Getty Images   Twitter","label":1},"truncated_cells":[]},{"row_idx":8,"row":{"text":"SWABI, Pakistan (Reuters) - Three police officers stand daily guard at the tomb of Pakistani student Mashal Khan to prevent religious hardliners from fulfilling threats to blow up the grave of the 23-year-old beaten to death over rumors he blasphemed against Islam. His grieving family, now also under police protection, say they have little hope the shocking campus killing will prompt a re-examination of blasphemy laws that carry a death penalty, or action against the mob justice that often erupts in such cases.  On Friday, there was more evidence the opposite is happening.  A new political party that has made punishing blasphemers its main rallying cry won a surprisingly strong 7.6 percent of the vote in a by-election in Peshawar, 60 km (36 miles) from where Mashal Khan was killed six months ago.  Death to blasphemers! Death to blasphemers!  was a common chant of supporters of the Tehrik-e-Labaik Pakistan party at its campaign rallies in the conservative northwestern city.  The party s relatively strong showing - and a separate outcry over a proposed change to an election law that outraged the religious right - has elevated blasphemy into a potent political issue in the run-up to a general election in 2018. While Tehrik-e-Labaik (Movement of the Prophet s Followers) is unlikely to break out of single digits in coming votes, its rapid rise, along with another ultra-religious party, could create an additional challenge for the ruling Pakistani Muslim League-Nawaz (PML-N).  The PML-N party s leader, Nawaz Sharif, was ousted as prime minister in July by the Supreme Court, and opposition leader Imran Khan - who spearheaded the legal case that removed him over unreported income - is seeking to press the advantage. In this week s Peshawar by-election, former cricket star Imran s Pakistan Tehreek-e-Insaf (PTI) party swept to a comfortable victory to retain the parliamentary seat, winning 34.8 percent of the vote. Sharif s PML-N had 18.9 percent, narrowly coming in third to the regionally strong Awami National Party that won just 40 more votes. But the gains by the Labaik party - formed just last year -  have grabbed attention. Labaik draws most of its support from the Barelvi branch of Sunni Islam, the largest sect in Pakistan that is traditionally considered moderate. Though the party does not publicly talk about its funding, the Barelvis have a network of mosques and madrassa religious schools that collect donations. The party emerged out of a protest movement against the state s execution of Mumtaz Qadri, a bodyguard of the governor of Punjab province who gunned down his boss in 2011 over his call to reform Pakistan s blasphemy laws, among the world s harshest, to prevent abuses. Qadri is considered a hero by the party, and its candidate in Peshawar, Muhammad Shafiq Ameeni, was equally supportive of Mashal Khan s killers, although the student s death was not a main feature at campaign rallies.  It was state s responsibility to punish a blasphemer, no two opinions, but when state doesn t do its job and someone does kill, he shouldn t be punished as a murderer,  Amini said, referring to the 57 people who face trial over Mashal Khan s death. In Pakistan, allegiance to Islam is the official line of most major parties, but ultra-religious parties have so far remained on the fringes.  Labaik is one of two new ultra-religious parties formed in roughly the past year. Together, Labaik and the Milli Muslim League (MML) gained about 11 percent of the vote in last month s by-election in Lahore and 10.4 percent in Peshawar, whereas the established religious parties, such as Jamaat-e-Islami and Jamaat Ulema-e-Islam, combined had 5.3 percent in the 2013 national election. Blasphemy is such an effective wedge issue in Pakistan because there is almost no defense against an accusation. For that reason, say critics, blasphemy laws are often invoked to settle personal scores and to intimidate liberal journalists, lawyers and politicians. Dozens of Pakistanis are sitting on death row after being convicted of insulting Islam s prophet, a specific charge that carries a mandatory death sentence, though no executions have been carried out in recent decades. Now, political parties may be in danger of facing blasphemy accusations themselves.  Earlier in October, the PML-N found itself in the middle of a firestorm when it voted through seemingly small changes to the nation s electoral law. The changes, among other things, turned a religious oath in the electoral laws stating that Mohammad was the last prophet of Muslims into a declaration using the words  I declare .  The alterations prompted accusations of blasphemy from the religious right and the government quickly retreated, terming the change a  clerical  mistake and apologizing in parliament. Labaik has vowed to hold a mass rally on Nov. 6 to demand the lawmakers responsible be prosecuted for blasphemy. Even before the Labaik party s political debut, politicians found promising swift action against blasphemers an easy way to appeal to conservative voters. In March, then-prime minister Sharif issued a public order to prosecute anyone posting blasphemous content online. The next month, Mashal Khan was accused of online blasphemy and beaten to death by fellow students and religious activists  as onlookers filmed the scene. Sharif said he was  shocked and saddened  by the  senseless display of mob justice . At least 67 people have been killed over unproven blasphemy allegations since 1990, according human rights groups. Mashal Khan s father, Iqbal, said his son was the victim of false rumors. The family has received death threats from right-wingers and Mashal s sisters had to drop out of school.  The snakes our country nurtured are now biting us,  the father said, two days before the Peshawar by-election, standing beside his son s gave strewn with flowers, lace and poetry.  Learning of the Labaik party s gains a few days later only made him more pessimistic about the government s ability to stop abuse of blasphemy accusations.  I know very well, I m not going to get my son back,  he said.  But this only adds to my pain.  ","label":0},"truncated_cells":[]},{"row_idx":9,"row":{"text":"If any other American company did this, Donald Trump would be attacking them on Twitter.But Trump has a double standard when it comes to his own business and the businesses owned by his family members.As you may recall, Trump has openly attacked Ford, General Motors, and a slew of other companies for building factories overseas instead of building them here and hiring American workers to do the jobs.Trump even attacked a Japanese automaker for building a factory in Mexico instead of in the United States.The hypocrisy here is that while Trump is attacking these companies for not hiring Americans, his own son is begging the Labor Department to let him hire foreign workers instead of giving jobs to Americans.Eric Trump owns Trump Vineyards, and for the second time he is asking the Labor Department to let him hire foreign workers.According to the petition filed, the workers would be paid over $11 an hour to perform manual labor in cold weather. Workers would also be exposed to chemicals and would have to lift up to 60 pounds of grapes onto a truck.Here s a screenshot of the specific section.Again, this is hypocritical. Donald Trump is constantly promising Americans that he will make sure they have jobs but his own son wants to hire foreign workers.This is yet another example of Trump not following the rules he s setting for everyone else.A real leader leads by example and if Trump refuses to tell his own son to hire American workers why should companies like Ford comply with his demands?Keep in mind that Trump is ordering raids to round up undocumented immigrants because Trump claims they take jobs away from Americans. The reality, however, is that these immigrants take jobs that most Americans do not want to perform, such as managing and harvesting crops. That doesn t mean there aren t American out there who wouldn t take them, and that means Eric Trump is taking jobs away from Americans by trying to hire foreign workers instead. That s shameful, especially since his dad promised to put America first.Featured image via Joe Raedle/Getty Images","label":1},"truncated_cells":[]},{"row_idx":10,"row":{"text":"WASHINGTON (Reuters) - Democratic presidential candidate Hillary Clinton called on pharmaceutical company Mylan NV to voluntarily drop the price of its severe allergy treatment drug EpiPen, which has increased in price by more than 400 percent in the past decade. “That’s outrageous - and it’s just the latest troubling example of a company taking advantage of its consumers,” Clinton said in a statement. “It’s wrong when drug companies put profits ahead of patients, raising prices without justifying the value behind them.” Clinton frequently said during the primary that she would fight pharmaceutical companies - part of an attempt to counter criticism that she was too closely tied to the insurance industry. She has released a proposal that she says will lower drug costs for consumers. Mylan spokeswoman Nina Devlin did not respond to inquiries about Clinton’s criticism of the company. Mylan acquired the product in 2007, and the price increased from $100 in 2008 to its current cost of $600. Shares of Mylan closed down more than 5 percent at $43.15 on the Nasdaq. “The price of EpiPen is outrageous,” said Robert Weissman, president of consumer watchdog group Public Citizen. “Mylan is endangering lives and ripping off the country.” Weissman said EpiPen’s U.S. price should be rolled back sharply, noting the product is available for as little as $112 in Canada. Many other drugmakers also routinely raise prices of their prescription drugs by 10 percent or more each year, and U.S. legislation is needed to prevent such “price spikes,” he added. The White House took a more cautious tone in criticizing rising drug costs, refusing to comment on the decisions of an individual company.  “I will observe, however, that pharmaceutical companies that often try to portray themselves as the inventors of life-saving medication often do real damage to their reputation by being greedy and jacking up prices in a way that victimizes,” White House spokesman Josh Earnest said at a news briefing.     Clinton joins a bipartisan group of lawmakers who are calling for investigations into the price increase of EpiPens, which are preloaded injections of epinephrine (adrenaline) that people use if they are having a dangerous allergic reaction that untreated could result in death.  Republican Senator Chuck Grassley, chairman of the Senate Judiciary Committee, wrote Mylan earlier in the week to ask for an explanation of the price change. Senator Amy Klobuchar, the top Democrat on the committee’s antitrust subcommittee, called for an investigation by the Federal Trade Commission. On Wednesday, Republican Senator Susan Collins and Democratic Senator Claire McCaskill requested that Mylan provide a briefing for the Senate to explain the price change. Grassley and Klobuchar, along with Democratic Senators Patrick Leahy and Richard Blumenthal and Republican Senator Ron Johnson, on Wednesday said they had written to the Food and Drug Administration to ask about its approval process for alternatives to the EpiPen. “Given the importance of this topic, it is imperative to understand the FDA’s role with respect to EpiPens and its approval of generic equivalents that could help to increase competition and lower prices if introduced,” the senators said in a statement.   “We have reached out to every member of Congress who has sent us a letter, and we look forward to meeting with them and responding to their questions as soon as possible,” Devlin said.  In January, Clinton admonished Valeant Pharmaceuticals International Inc, which raised the price of a heart drug. In the wake of a Clinton campaign blog post targeting Valeant, the company’s stock fell. In March, she released a campaign ad vowing to target the company specifically.  Clinton also criticized Turing Pharmaceuticals in the fall of 2015 when public ire rose after it decided to raise the price of an antiviral medication commonly used by AIDS patients and pregnant women from $13.50 a tablet to $750 each.  After a single post by Clinton on the social media website Twitter critical of Turing, the company’s stock price tumbled.  At that time, Clinton released a comprehensive drug price plan that she says would reduce costs. Her proposal includes capping monthly out-of-pocket costs, expanding generic drug access and allowing Americans to buy pharmaceuticals abroad.  Republican presidential candidate Donald Trump has said little about lowering drug prices. He has proposed increasing the amount of negotiations permitted by Medicare in order to lower prices for those using the program. ","label":0},"truncated_cells":[]},{"row_idx":11,"row":{"text":"HONG KONG (Reuters) - As Hong Kong seeks more land to help ease a worsening housing crisis, some lawmakers and activists are urging officials to take a fresh look at little-used swathes of more than $100 billion worth of real estate controlled by the Chinese military. The Hong Kong garrison of the People s Liberation Army (PLA) still occupies some 19 sites across the global financial hub it inherited from the British military when the former colony was handed back to China in 1997. While several sites, such as the high-rise barracks near the Central financial district, are neon-lit and busy, others appear overgrown, rundown and little used, according to Reuters investigations, activists and diplomats monitoring military activity. The parcels range from mansions in the exclusive Peak district and once-luxurious officers  apartments in Hong Kong and Kowloon, to firing ranges and decades-old Nissen huts across the semi-rural New Territories, near the border with mainland China. With Hong Kong property prices at record highs, Denis Ma, head of research at property consultancy JLL, said a mid-range estimate of the total land value could reach HK$1.06 trillion  ($135 billion). Based on the recent sale of a nearby plot, the Central site alone could be worth $29 billion and deliver 4.5 million square feet of floor space if developed into a commercial site. Suitable residential land among the 19 sites could yield 65,000 family-sized apartments, Ma added. Across Hong Kong, the PLA occupies some 2,700 hectares (6,670 acres), according to local government records, nearly half the size of Manhattan. A lack of housing is a source of rising social and political tension in Hong Kong, one of the world s most expensive property markets where owning even a 600-square foot flat is beyond the reach of many families.  A recently formed government task force on land supply acknowledged public calls for some military land to be returned for housing, but its chairman has said their development potential  may not be large .  The task force s initial meetings have instead advocated developing 1,400 hectares of new land through reclamation.  The preference for costly reclamation over re-purposing PLA land has led some to believe the Hong Kong government does not want to confront the Beijing leadership over a potentially sensitive issue of national security. Under the laws that enshrine Hong Kong s freedoms and autonomy, Beijing is given direct control of defense and foreign affairs. Reuters sent questions to Hong Kong leader Carrie Lam, the government s development bureau and the task force. In reply, a spokesman told Reuters the task force would consider ideas from the community,  their facts as well as their pros and cons . It would finalize its recommendations by the end of 2018.  As far as we understand, all existing military sites in Hong Kong are currently used for defense purposes and none is left idle,  the spokesman said, quoting Hong Kong s security bureau. Lawmaker Eddie Chu, part of Hong Kong s democratic opposition, said even though it was common sense to open up some military sites for housing, the local government would likely avoid asking tough questions of Beijing.  The Hong Kong government must know this is a solution, but I expect them to pay lip service to it,  he said. The PLA garrison and China s Defence Ministry did not respond to faxed questions from Reuters.  Security experts say while some PLA presence is a fact of life, the city s defense needs are easily met by Beijing s rapidly modernizing forces - a vastly different situation to that faced by the British in defending their outpost during the Cold War.  Hong Kong has never been so well defended ... it is a tiny segment of the mainland and is surrounded by the now significant forces of the Southern Theatre Command of the PLA,  said Trevor Hollingsbee, a former Hong Kong security official and naval intelligence analyst with Britain s Defence Ministry.  Rather than serve a vital strategic interest, the PLA presence in Hong Kong is essentially to show the public who is boss.   After inspecting the garrison as part of 20th handover anniversary celebrations in June, Chinese President Xi Jinping told the troops they were  an important embodiment to national sovereignty , according to state media. As well as its Central barracks, security experts and diplomats believe a naval base and small airfield are considered key local sites to the PLA, along with a Kowloon barracks that houses light tanks and anti-riot units.  Another 10-hectare Kowloon site and residential blocks near Shek Kong appear barely used, according to activists and Reuters  own checks. Soldiers armed with rifles and bayonets guard the entrance to the Kowloon site, but some buildings appear dilapidated, others rundown and many are unoccupied. At Shek Kong, the residential blocks appear little used, day or night, and security is lax. In camps closer to the border, small deployments of troops drill at dawn outside aging British-era huts and weed-choked fences. The 122 hectares of the Stanley fort on Hong Kong s prime southern coast is also underutilized, according to diplomats. About half of the 8,000-10,000 soldiers of the Hong Kong garrison are based in the city at any time, security experts and diplomats believe. Key units are kept in southern China, along with its most advanced weaponry, including jet fighters and air defense weapons.  Chinese laws covering the garrison state that any unused land, after central government approval, should be handed back  without compensation  to the local authorities, so any deal would likely have no benefits for the PLA s coffers.  Community organizer Sze Lai-shan, who assists some of the city s 200,000 people living in wire cages and partitioned homes, said all options for the land should be on the table. I think using some for temporary housing shouldn t be a big issue,  Sze said.  We could perhaps use some existing buildings for temporary housing, or even build temporary housing on some sites.   ","label":0},"truncated_cells":[]},{"row_idx":12,"row":{"text":"TEGUCIGALPA (Reuters) - Honduras  election tribunal will re-count 4,753 ballot boxes that have cast a shadow on the results of the country s presidential election, the tribunal chief said on Thursday, bowing to a demand by the Organization of American States (OAS). Nearly two weeks since Honduras  Nov. 26 presidential election, the result remains unknown, with allegations of electoral fraud sparking protests and a chorus of international concern over events in the poor Central American nation.  Official results showed Honduras  conservative President Juan Orlando Hernandez with a narrow 1.6 percentage point lead over center-left opposition leader Salvador Nasralla. However, no victor has yet been declared by the election tribunal. The tribunal declared Nasralla the leader in an announcement on the morning after the vote, with just over half of the ballot boxes counted. However, it gave no further updates for about 36 hours. Once results then started flowing again, Nasralla s lead quickly started narrowing.  On Thursday, after meeting with the United States  top diplomat in Honduras and the OAS country representative, tribunal chief David Matamoros said there would be a re-count of ballot boxes that arrived after the 36-hour pause, and which the opposition has claimed are tainted.  This is a process we want to undertake in front of the eyes of the world, and we want to invite civil society,  Matamoros said at a press conference in the capital, Tegucigalpa.  The OAS, which on Wednesday said it may call for new Honduran elections if  irregularities  undermine the credibility of results, had previously called for a recount of those 4,753 ballot boxes. It remains to be seen if the opposition will accept the tribunal s offer. Nasralla on Wednesday evening called for an international arbiter to oversee a recount of the entire 18,000-odd ballot boxes, saying he no longer recognized the Honduran tribunal because of its role in the process. Separately, Honduras  security ministry said on Thursday it was removing the curfew from three more departments, meaning only six of the country s 18 departments are still under curfew. ","label":0},"truncated_cells":[]},{"row_idx":13,"row":{"text":"WASHINGTON (Reuters) - The Republican chairman of the House of Representatives Armed Services Committee called President Donald Trump’s reported $603 billion defense budget request low on Monday, a sign of the fight ahead between Trump’s party and Democrats, who oppose slashing non-military spending to boost Pentagon funding. “Over the course of the Obama Administration, our military funding was cut 20 percent while the world grew more dangerous. While we cannot repair all of the damage done by those cuts in a single year, we can and should do more than this level of funding will allow,” Representative Mac Thornberry said in a statement. “The administration will have to make clear which problems facing our military they are choosing not to fix,” he said. It was not immediately clear why Thornberry alluded to a $603 billion figure.  ","label":0},"truncated_cells":[]},{"row_idx":14,"row":{"text":"Just when you thought things couldn t get crazier and more bizarre in the future Donald Trump administration, the president-elect just nominated ex-WWE CEO Linda McMahon to head the Small Business Administration, which is considered a cabinet role.According to Reuters: U.S. President-elect Donald Trump plans to nominate professional wrestling magnate and former Senate candidate Linda McMahon as his choice to head the Small Business Administration, transition officials told Reuters on Wednesday. Trump picks Linda McMahon to lead the Small Business Administration pic.twitter.com/sIWGV4MJsd  Bradd Jaffy (@BraddJaffy) December 7, 2016Reuters points out: McMahon, 68, is a co-founder and former CEO of the professional wrestling franchise WWE, which is based in Stamford, Connecticut. She ran unsuccessfully for a U.S. Senate seat in Connecticut in 2010. She was an early supporter of Trump s presidential campaign. Further: The SBA, which has at least one office in every U.S. state, provides support to small businesses such as extending loans and making sure they get a percentage of federal contracts. And nothing says  small business  like the WWE! It s likely one of the largest entertainment companies around, and Trump is likely giving her the position as a personal favor for all her years of support and friendship. In fact, McMahon donated $6 Million to Trump s presidential campaign. Talk about pay for play. Linda s contributions in August and September alone reportedly make up nearly one third of the money raised by Rebuilding America Now, The Donald s super PAC, making her one of the leading external donors for the Republican party during this election. This entire scenario is just mind-boggling and beyond obscene. It s almost as if Trump is going out of his way to be as horrible as possible. Between white supremacists and the WWE running this country, hopefully we make it until 2020 to make sure Trump gets voted out.In the mean time, we really need to focus on the 2018 midterms.Read more:Featured Photo by Bill Pugliano/Getty Images","label":1},"truncated_cells":[]},{"row_idx":15,"row":{"text":"Eureka! We figured out why Hillary won t let the press see her off: The campaign of Democratic presidential frontrunner Hillary Clinton has poured more than $2 million into the use of private jets this election cycle, according to a review of its expenditures.Federal Election Commission documents reviewed by the Washington Free Beacon found that Hillary for America made a total of 48 payments from June 1, 2015, to Jan. 29, 2016, to Executive Fliteways, a New York-based private jet company, running up a tab of $2,128,293 for the campaign.Executive Fliteways is considered  one of the largest independently owned and operated charter companies in the country  and boasts a fleet of private planes ranging from  mid-size,  which can seat seven or eight passengers, to  heavy,  which can carry 12 to 16 people.While it is not clear which jet Clinton prefers on the campaign trail, or if they routinely switch between the jets they use, Clinton has been pinned on Executive Fliteways  Falcon 900B  heavy jet  in the past, according to a media reports. Hillary boarded the plane, which burns 347 gallons of fuel per hour, shortly after laying out her campaign s plan to combat global warming.ABC REPORTER Liz Kreutz TWEETED OUT THIS MESSAGE WITH A PHOTO:     Clinton staff won t allow press to film HRC boarding her charter. We must get on our plane before she gets out of car The Falcon 900B heavy jet carries a price tag of $5,850 per hour and comfortably seats 12 passengers. The luxury accommodations includes a full service galley, executive workstation, onboard WiFi, a full-size private lavatory, and a flight attendant for the  ultimate inflight experience,  according to the company s website.Via: WFB","label":1},"truncated_cells":[]},{"row_idx":16,"row":{"text":"The stock market lost over 350 points after ABC News erroneously reported that General Flynn was in communication with the Russian Ambassador Sergey Kislyak during Trump s campaign. It turns out that after the stock market plunge and the feeding frenzy by the leftist media, ABC News got it wrong. Flynn was actually in contact with the Russian Ambassador during the Trump transition period, which is an entirely different story. In fact, according to a video that was uncovered by citizen journalist Jack Posobiec, Obama s State Department told reporters during the Trump transition period, that the State Department didn t have any problem with the transition team meeting with any foreign officials (See video below). According to CNN correspondent Jim Acosta, the Obama regime actually gave the  go-ahead  for Flynn to have conversations with the Russian Ambassador: On Friday, the White House said that it was the Obama administration that authorized former national security adviser Michael Flynn s contacts with Russian Ambassador Sergey Kislyak during President Trump s transition, according to CNN. Flynn pleaded guilty on Friday to lying to the FBI about his contacts with Kislyak in the month before Trump took office, the first current or former Trump White House official brought down by special counsel Robert Mueller s investigation into Russian election meddling. Court records indicate that his communications with Kislyak were directed by a Trump transition official, with multiple news outlets reporting that official was Trump s son-in-law and senior adviser Jared Kushner.  They are saying here at the White House that Flynn s conversations with Sergey Kisylak were quote,  authorized  by the Obama administration,  CNN correspondent Jim Acosta said.General Michael Flynn released the statement below: After over 33 years of military service to our country, including nearly five years in combat away from my family, and then my decision to continue to serve the United States, it has been extraordinarily painful to endure these many months of false accusations of  treason  and other outrageous acts. Such false accusations are contrary to everything I have ever done and stood for. But I recognize that the actions I acknowledged in court today were wrong, and, through my faith in God, I am working to set things right. My guilty plea and agreement to cooperate with the Special Counsel s Office reflect a decision I made in the best interests of my family and of our country. I accept full responsibility for my actions.    The HillWatch Obama s State Department clarifying to a reporter that they have no problem with General Flynn and the Trump transition team talking to foreign officials:Obama State Dept: We have no problem with General Flynn and the incoming administration contacting foreign officials pic.twitter.com/FwZDaHU8lO  Jack Posobiec   (@JackPosobiec) December 2, 2017","label":1},"truncated_cells":[]},{"row_idx":17,"row":{"text":"WASHINGTON (Reuters) - President Donald Trump will pummel foes and embrace friends in his first speech to the United Nations General Assembly next week, keeping pressure on Washington’s adversaries North Korea  and Iran, U.S. Ambassador Nikki Haley said on Friday. Briefing reporters ahead of the annual U.N. meeting, Haley and White House national security adviser H.R. McMaster took a tough line on North Korea, warning that a military option to deal with its nuclear threats was available. Trump will meet with leaders from Europe, Asia, the Middle East and Latin America throughout the week, but his remarks, scheduled for Tuesday morning, will be the president’s highest profile opportunity to explain his foreign policy vision couched in his “America first” agenda. “I personally think he slaps the right people, he hugs the right people, and he comes out with (the) U.S. being very strong, in the end,” Haley, speaking at the White House, said of Trump’s speech. Haley declined to say whether Trump would commit Washington to maintaining its current level of funding for the 193-nation body. Trump has complained that the United States funds 22 percent of the U.N. budget and nearly 30 percent of U.N. peacekeeping duties. Trump will kick off the week with a meeting about U.N. reform on Monday. He will then have meetings with French President Emmanuel Macron and Israeli Prime Minister Prime Minister Benjamin Netanyahu that will focus on Iran, McMaster said. Trump has dinner scheduled with Latin American leaders. On Tuesday, he will meet Qatar’s emir, Sheikh Tamim bin Hamad al-Thani. Trump said last week he would be willing to mediate the worst dispute in decades between Qatar and U.S.-allied Arab states. On Wednesday, he will meet with leaders from Jordan, the Palestinian Authority, Britain and Egypt and on Thursday there are talks scheduled with leaders from Turkey, Afghanistan and Ukraine before holding a lunch with the leaders of South Korea and Japan. McMaster said it was unlikely that Trump would speak to Venezuela’s President Nicolas Maduro, whom the White House has sanctioned and called a dictator. ","label":0},"truncated_cells":[]},{"row_idx":18,"row":{"text":"Vic Bishop Waking TimesOur reality is carefully constructed by powerful corporate, political and special interest sources in order to covertly sway public opinion. Blatant lies are often televised regarding terrorism, food, war, health, etc. They are fashioned to sway public opinion and condition viewers to accept what have become destructive societal norms.The practice of manipulating and controlling public opinion with distorted media messages has become so common that there is a whole industry formed around this. The entire role of this brainwashing industry is to figure out how to spin information to journalists, similar to the lobbying of government. It is never really clear just how much truth the journalists receive because the news industry has become complacent. The messages that it presents are shaped by corporate powers who often spend millions on advertising with the six conglomerates that own 90% of the media:General Electric (GE), News-Corp, Disney, Viacom, Time Warner, and CBS. Yet, these corporations function under many different brands, such as FOX, ABC, CNN, Comcast, Wall Street Journal, etc, giving people the perception of choice   As Tavistock s researchers showed, it was important that the victims of mass brainwashing not be aware that their environment was being controlled; there should thus be a vast number of sources for information, whose messages could be varied slightly, so as to mask the sense of external control. ~ Specialist of mass brainwashing, L. WolfeNew Brainwashing Tactic Called AstroturfWith alternative media on the rise, the propaganda machine continues to expand. Below is a video of Sharyl Attkisson, investigative reporter with CBS, during which she explains how  astroturf,  or fake grassroots movements, are used to spin information not only to influence journalists but to sway public opinion. Astroturf is a perversion of grassroots. Astroturf is when political, corporate or other special interests disguise themselves and publish blogs, start facebook and twitter accounts, publish ads, letters to the editor, or simply post comments online, to try to fool you into thinking an independent or grassroots movement is speaking. ~ Sharyl Attkisson, Investigative ReporterHow do you separate fact from fiction? Sharyl Attkisson finishes her talk with some insights on how to identify signs of propaganda and astroturfing  These methods are used to give people the impression that there is widespread support for an agenda, when, in reality, one may not exist. Astroturf tactics are also used to discredit or criticize those that disagree with certain agendas, using stereotypical names such as conspiracy theorist or quack. When in fact when someone dares to reveal the truth or questions the  official  story, it should spark a deeper curiosity and encourage further scrutiny of the information.This article (Journalist Reveals Tactics Brainwashing Industry Uses to Manipulate the Public) was originally created and published by Waking Times and is published here under a Creative Commons license with attribution to Vic Bishop and WakingTimes.com. It may be re-posted freely with proper attribution, author bio, and this copyright statement. READ MORE MSM PROPAGANDA NEWS AT: 21st Century Wire MSM Watch Files","label":1},"truncated_cells":[]},{"row_idx":19,"row":{"text":"(Reuters) - A New York comedian has been compelled to appear before a House Intelligence Committee investigating suspected Russian meddling in the 2016 U.S. election where he will likely face questions about acting as a go-between for Wikileaks and an ally of President Donald Trump.  Randy Credico, a political activist who hosted a radio show on New York radio, is scheduled to appear in front of the committee on Dec. 15, according to a photo of the subpoena posted on his Twitter account.  On several occasions over the last few years, Credico interviewed and met with WikiLeaks founder Julian Assange, a man believed by some U.S. officials and lawmakers to be an untrustworthy pawn of Russian President Vladimir Putin.  Assange’s group released Democratic emails during the 2016 presidential campaign that U.S. intelligence agencies say were hacked by Russia to try to tilt the election against Democratic candidate Hillary Clinton. He is regarded with distaste by many in Washington, although Trump, then the Republican candidate, supported the group’s email releases last year. Credico has also interviewed Republican political consultant Roger Stone, a longtime Trump ally, who he worked with in the past to reform New York’s drug laws, according to the New York Times.  Stone flatly denied allegations of collusion between the president’s associates and Russia during the 2016 U.S. election in a meeting with House of Representatives Intelligence Committee in September.  During his appearance in front of the committee, Stone refused to identify an “opinion journalist” who had acted as a go-between between Stone and Assange. According to Stone’s own account to Reuters, he “reluctantly” identified the journalist as Credico in written communication to the committee.  The committee has been interested in predictions that Stone made about damage the email release would have on Clinton’s campaign, the Times reported. ","label":0},"truncated_cells":[]},{"row_idx":20,"row":{"text":"This is a major conflict of interest that should automatically disqualify him.When the Senate Judiciary Committee voted along party lines to approve Donald Trump s nomination of Brett Talley to a federal judgeship in Alabama, they did so without knowing that Talley is married to White House lawyer Ann Donaldson, who is the chief of staff to White House counsel Donald McGahn.That s a pretty big detail to leave out of a disclosure form.According to the New York Times,Mr. Talley was asked on his publicly released Senate questionnaire to identify family members and others who are  likely to present potential conflicts of interest.  He did not mention his wife.District judges often provide the first ruling when laws are called into question, decisions that can put them at odds with the White House and its lawyers. Last month, for example, judges in Hawaii and Maryland temporarily blocked Mr. Trump s travel ban.Mr. Talley also did not mention his wife when he described his frequent contact with White House lawyers during the nomination process.Talley has also never tried a case in his life, making him even more unqualified to be a judge. In fact, the American Bar Association judged Tally as  unqualified  for the position in a very rare unanimous decision.The Senate could hold a confirmation vote as early as Monday, and it is important that they reject Talley, especially since he lied to them by omission.If Republicans confirm Talley, they will be telling future nominees that it s okay to lie to Congress in order to get an important job. That should not be allowed to happen. Trump and Republicans often claim that immigration should be based on merit. Well, becoming a federal judge should definitely be based on merit, not based on who you re married to and whether you ll be a rubber stamp for a corrupt administration.Featured Image: Win McNamee/Getty Images ","label":1},"truncated_cells":[]},{"row_idx":21,"row":{"text":"SEOUL (Reuters) - South Korea said on Thursday practical and forceful measures than can inflict pain on North Korea should be included in U.N. sanctions, a new batch of which have yet to be announced.  Foreign ministry spokesman Cho June-hyuck told reporters the measures should be taken in addition to  surely severing  funds that can be used for the North s programs to develop weapons of mass destruction.  The United States wants the U.N. Security Council to impose an oil embargo on North Korea, ban its exports of textiles and the hiring of North Korean laborers abroad, and subject leader Kim Jong Un to an asset freeze and travel ban, according to a draft resolution seen by Reuters on Wednesday.  ","label":0},"truncated_cells":[]},{"row_idx":22,"row":{"text":"Last night, Trump International Hotel in Washington, DC played host to a temporary art installation. The words  pay Trump bribes here  and  emoluments welcome  were projected on the front entrance of the building. The project instantly captured the attention of Twitter and went viral even as it was happening. This morning, we learned that the projection was another project of DC-based artist Robin Bell. Bell, who works as a video journalist and multimedia artist for his own Bell Visuals, has put together projects like this before. In November of last year, Bell put together a similar campaign to oppose the climate change-denier that Trump put in charge of his EPA transition team. He has also put together other projects in support of cannabis legalization and in support of women s reproductive rights.In an interview with the Los Angeles Time, Bell said that he s not worried about getting in trouble for his art installations. These fringe alt-right groups have gone from a minority of hateful assholes to having the ear of the president, which is terrifying,  Bell says.  The work that we do is a resistance to that. He said,  When we first started doing it, we were concerned and we reached out for legal advice. But from the research we did, it was legal. The one thing we can t do is block traffic. We can t create an impediment on the sidewalk. According to Bell, his largest goal is to get people talking about the issues. But he also sees his art as a way to fight against an authoritarian government.  I was reading this thing about when you deal with authoritarian governments, you have to create your own story,  he says.  If we re reacting to these people all the time, they can just play us. So, part of the thing is making things that you can laugh at, that you can share, that aren t just reacting to them. Photography and video copyright Liz Gorman and Robin Bell","label":1},"truncated_cells":[]},{"row_idx":23,"row":{"text":"Trump loves to brag about his foundation while simultaneously ripping the Clinton foundation, because he s Donald Trump and Donald Trump has the best of everything. Except the Trump Foundation never went and got the certification the State of New York requires for non-profit organizations to solicit money from donors. That could actually shut the foundation down.Any charity that s based in New York, and solicits more than $25,000 per year, must get special registration, and must also submit to strict and severe annual audits. These audits that ask whether the organization spent any money on behalf of its officers, which is something Trump does with abandon.Trump is already in trouble for using funds from the foundation to pay off more than $250,000 in personal lawsuits. He also used foundation money to advertise his hotels, and to buy portraits of himself. This is known as  self-dealing,  and it is illegal. But legalities are just details to Trump. They don t matter as long as he gets what he wants.The Trump Foundation is also in trouble with the IRS, which fined the Trump Foundation $2,500 for donating to Florida Attorney General Pam Bondi s re-election campaign at the same time she was considering investigating the scam known as Trump University. Whatever he says, he was trying to buy her off and we all know it.In other words, the foundation is in water that s so hot it ll reach its boiling point soon. Then what happens? If New York Attorney General Eric Schneiderman finds that the Trump Foundation illegally raised money, he can order them to stop doing so immediately.Schneiderman could also get a court to order the foundation to return the money it s raised. That could potentially bankrupt it.Trump s campaign manager, Kellyanne Conway, said recently that the foundation s money is Trump s while she was trying to blow up Trump s amazing generosity. When she was corrected, she said that the foundation s money comes from Trump. It doesn t. Trump hasn t donated much to his own foundation since 2008. The vast majority of the money   far more than $25,000 per year comes from outside donors.And it s illegal. Trump s sins are coming back to bite him just in time for November.Featured image by Ethan Miller/Getty Images","label":1},"truncated_cells":[]},{"row_idx":24,"row":{"text":"It s a bromance for the ages. One that may go down in history. Glenn Beck, while on the campaign trail in Iowa with Ted Cruz, formally endorsed the Republican candidate. However, that s not even the half of it.For most of the day, Beck was sending out these cryptic love notes regarding his feelings towards Cruz. Even going so far as to imply that Cruz is the next George Washington. Althoug, George Washington was actually born in the United States, we can t say as much for Cruz.The tweets really need to be put into letter form, so that s exactly what I ll do for you here: This election is about more than someone who understands your anger; it is about those who can stand shoulder to shoulder with you. I used to worry folks would vote party over principle. This year is worse   it s paparazzi over principle. I need more than someone to vice my anger   I need someone to have my back. The George Washington we need will not be found in the garish light of gold. Do we really want another 8 years of a president who views his role as a Benevolent Dictator? The president does not create jobs. He helps create the conditions in which WE THE PEOPLE create jobs and change lives.I have prayed for the next George Washington   I believe I have found him. The presidency is not just a man, it is principles. That s why I stand with Ted Cruz. Our children deserve hope of a better tomorrow than our yesterdays; they deserve Ted Cruz. I am officially endorsing Ted Cruz to become the first Hispanic president!Connect with truth. Connect with freedom. Connect with Cruz.No, one man makes America great. But each of us as individuals, living our own lives, believing in our own strengths. That makes the USA great. Well, actually Beck, you ve made it pretty darn clear that you believe Ted Cruz is going to be your one and only in making the nation what you want it to be. While your passion for Cruz can be admired, your facts regarding your beloved candidate aren t quite accurate. Ted Cruz is no George Washington. Not even close. However, keep believing in your heart of hearts that Cruz is the man of your campaign dreams. If it s something you can hold close, do it. It may be all you have this election season.Here s the full series of tweets with a few jabs thrown at Trump and Hillary Clinton as well:This election is about more than someone who understands your anger; it is about those who can stand shoulder to shoulder with you.  Glenn Beck (@glennbeck) January 23, 2016It's amazing how much time this presidential candidate is spending on someone who is so \"irrelevant\" cc @realDonaldTrump  Glenn Beck (@glennbeck) January 23, 2016.@realDonaldTrump may not to need God s forgiveness, how about asking America s forgiveness 4 supporting trillions in Wall Street bailouts.  Glenn Beck (@glennbeck) January 23, 2016I used to worry folks would vote party over principle. This year is worse   it's paparazzi over principle. #GlennInIowa  Glenn Beck (@glennbeck) January 23, 2016I need more than someone to vice my anger   I need someone to have my back  Glenn Beck (@glennbeck) January 23, 2016The George Washington we need will not be found in the garish light of gold  Glenn Beck (@glennbeck) January 23, 2016Do we really want another 8 years of a president who views his role as a Benevolent Dictator?  Glenn Beck (@glennbeck) January 23, 2016The president does not create jobs. He helps create the conditions in which WE THE PEOPLE create jobs and change lives.  Glenn Beck (@glennbeck) January 23, 2016I have prayed for the next George Washington   I believe I have found him  Glenn Beck (@glennbeck) January 23, 2016.@HillaryClinton should be in prison  Glenn Beck (@glennbeck) January 23, 2016The presidency is not just a man, it is principles. That's why I stand with @tedcruz @SenTedCruz  Glenn Beck (@glennbeck) January 23, 2016Our children deserve hope of a better tomorrow than our yesterdays; they deserve @tedcruz  Glenn Beck (@glennbeck) January 23, 2016I am officially endorsing Ted Cruz to become the first Hispanic president! @tedcruz #iacaucus  Glenn Beck (@glennbeck) January 23, 2016Connect with truth. Connect with freedom. Connect with Cruz. @SenTedCruz @tedcruz  Glenn Beck (@glennbeck) January 23, 2016No, one man makes America gr8t. But each of us as individuals, living our own lives, believing in our own strengths. That makes the USA gr8t  Glenn Beck (@glennbeck) January 23, 2016Featured image: Twitter","label":1},"truncated_cells":[]},{"row_idx":25,"row":{"text":"WASHINGTON (Reuters) - The House of Representatives Ethics Committee said on Wednesday it had opened an investigation into Democratic congresswoman Corrine Brown of Florida. The committee said in a news release that it voted on March 16 to establish an investigative subcommittee to look into allegations Brown improperly solicited charitable donations, used campaign funds for personal purposes, failed to comply with tax laws and made false statements to the House and the Federal Election Commission. ","label":0},"truncated_cells":[]},{"row_idx":26,"row":{"text":"BRASILIA (Reuters) - A congressional committee voted 39-26 on Wednesday to reject charges against Brazilian President Michel Temer stemming from a corruption case involving the world s largest meatpacker. The full lower house of Brazil s Congress still must vote on the charges but is expected to shelve them next week, sparing Temer from trial by the Supreme Court for alleged obstruction of justice and membership in a criminal organization.  Temer was accused of taking bribes and condoning the payment of hush money to a jailed politician in testimony by meatpacker Joesley Batista.  Temer has denied any wrongdoing and his lawyers argued that the case against him was flawed because it was based on an inconclusive recording that Batista secretly made of a conversation with the president. The lower chamber decides whether a Brazilian president can be put on trial. Two-thirds of its members must vote to approve a charge for it to move forward, a hurdle his opponents are not expected to clear. Temer survived an earlier corruption charge in the lower house in August in connection with the same graft scheme in which prosecutors accused him of arranging to receive a total of 38 million reais ($11.8 million) in bribes from JBS SA. In committee debates on Wednesday, opposition Congressman Alessandro Molon, of the center-left party called Sustainability Network, said Temer was part of a criminal organization that collected bribes. He accused the president of taking part in decisions on how the money was distributed. Workers Party lawmakers called for Temer to stand trial, saying the charges against him were more serious than those leveled at his predecessor Dilma Rousseff, who was impeached last year for a lesser crime of violating budget rules. But Temer s allies argued that the charges should be thrown out because the country needs Temer to serve out his mandate through the end of 2018 for political and economic stability. They said Temer has recovered Brazil from its worst recession, brought inflation under control, restored the purchasing power of Brazilian consumers and should stay in office to recover investor confidence. Presidential aides said Temer will now be able to get on with his economic policy agenda focused on boosting weak growth and bringing a bulging government budget deficit under control. The political capital and time Temer has spent defending himself, however, has delayed approval of a crucial overhaul of the pension system, the main cause of the fiscal deficit that cost Brazil s its investment-grade credit rating in 2015. Temer will be hard pressed to get the unpopular pension bill approved before the 2018 election year starts and promised reform of Brazil s burdensome tax system might is now unlikely.     ","label":0},"truncated_cells":[]},{"row_idx":27,"row":{"text":"Tune in to the Alternate Current Radio Network (ACR) for another LIVE broadcast of  The Boiler Room tonight 6:00 PM PST | 8:00 PM CST | 9:00 PM EST for this special broadcast. Join us for uncensored, uninterruptible talk radio, custom-made for bar fly philosophers, misguided moralists, masochists, street corner evangelists, media-maniacs, savants, political animals and otherwise lovable rascals.Join ACR hosts Hesher and Spore along with Jay Dyer of Jays Analysis, Patrick Henningsen of 21WIRE, Randy J (ACR contributor) and Andy Nowicki, author of Conspiracy, Compliance, Control & Defiance, for the hundred and sixth episode of BOILER ROOM. Turn it up, tune in and hang with the ACR Brain-Trust for this weeks boil downs and analysis and the usual gnashing of the teeth of the political animals in the social reject club. We re breaking down the developments of a potential Israeli Missile attack in Syria, North Korea as a joke of a Nuclear threat and the utter failure of Netflix and the Bill Nye show to influence viewers to join his cult of lab coats and bow ties with the catch phrase being  I told you so  because IT IS SCIENCE!  Does Bill Nye promote eugenics and incarceration of anyone who doubts his version of science  You bet he does, just watch his new show if you have any doubt.Listen to  Boiler Room EP #106   Israel Attacks Damascus & Bill Nye The Psyop Guy  on Spreaker.Direct Download Episode #106Please like and share the program and visit our donate page to get involved!Reference Links:","label":1},"truncated_cells":[]},{"row_idx":28,"row":{"text":"Tell us again Barack, about the  poor widows and orphans  who are being strategically placed in our small towns and communities across America. With all the rape and violence being committed by these  refugees,  why in the world would we welcome these savage animals into our country? Oh that s right to vote for Democrats A Muslim councilor has admitted that some feel as though  it takes two to tango  as 12 men were jailed for gang-raping a 13-year-old white girl in West Yorkshire.The gang of men from Pakistani origin were jailed for a total of 143 years at Bradford Crown Court today, for 13 months of horrendous abuse of the British white girl in 2011 and 2012. However, the Councillor for Keighley Central, where the abuse took place, has admitted that some members of the community felt  it takes two to tango  and that the girl may have  played her part .Zafar Ali, who has been a member of the Keighley Mosque for decades believes that some of the men may have attended in the past, but said the Muslim community totally condemn their actions.He told MailOnline:  Everyone now believes that justice has been done, we need to move forward and it is a lesson for the whole Muslim community. There are a few bad apples but this does not represent the Muslim community as a whole and any sensible Muslim totally condemns these actions. Eleven of the men were today jailed for rape and a twelfth man was jailed for sexual activity with a child under 16 today at Bradford Crown Court, but the ringleader has fled to Bangladesh.West Yorkshire Police confirmed that the men jailed were of Pakistani origin.The sentences come as it emerged that:Ringleader Ahmed Al-Choudhury who facilitated most of the offences is believed to now be living in Bangladesh after fleeing at the beginning of the investigation in 2012 After the sentencing, Kris Hopkins, Conservative MP for Keighley spoke out against the  sick model of organized groups of  Asian men  grooming young white girls , but said there are more women out there who need justice.He said the sentenced were vindication for controversial comments he made during a parliamentary debate in 2012, claiming that organised groups of Asian men were  going around raping white girls .However, he claims that even today he has been  lambasted  for even mentioning that the men are Asian when talking about the sentences.He told MailOnline:  There are sexual offenders who are white, but the fact is this particular model is all  Asian men  and all the victims were white. I was attacked in 2012 and today, when these men were convicted, the community was silent. You have to ask yourself why these men get away with this behavior. There is broader issues around the way women are treated in that community, there are hundreds if not thousands of women who live behind that door and have no voice. In a Commons speech three years ago, Mr Hopkins caused controversy three years ago when he suggested Muslim men were  fundamentally  sexist towards women.Judge Roger Thomas QC condemned the  insolent and disrespectful behaviour  the accused showed in court which he said reflected their treatment of their victim.They showed her no shred of decency or humanity when as a vulnerable child she so needed care and understandingJudge Roger Thomas QC told them:  The attitudes of the majority of you have so clearly demonstrated to these proceedings has been contemptuous, disrespectful and arrogant on a scale that I have hardly seen before in many years of practice in criminal law.  Exactly the same attitude to the 13/14 year old girl who you all sexually abused and exploited for your own selfish gratification. He added:  None of these defendants had any concern for the victim. They were totally uninterested in her welfare and what damage they were causing her. The victim clearly demanded pity and understanding but their view of her was heartless and demeaning. They saw her as a pathetic figure who had no worth and who served no purpose than to be an object that they could sexually misuse and cast aside. Via: Daily Mail ","label":1},"truncated_cells":[]},{"row_idx":29,"row":{"text":"PENSACOLA, Fla. (Reuters) - U.S. Republican presidential nominee Donald Trump vowed on Friday that any Iranian vessels that harass the U.S. Navy in the Gulf would be “shot out of the water” if he is elected on Nov. 8. Trump, at a rally before thousands of supporters in Pensacola, Florida, laid out an aggressive national security policy with a beefed-up U.S. military “so strong that nobody’s going to mess with us.” He talked tough about how he would respond to any Iranian harassment of American ships in the Gulf. A U.S. Navy coastal patrol ship changed course after an Iranian fast-attack craft came within 100 yards (91 meters) of it on Sunday. It was the fourth such incident in the past month. “When they circle our beautiful destroyers with their little boats and they make gestures at our people that they shouldn’t be allowed to make, they will be shot out of the water,” he said. Trump has based his foreign policy beliefs on keeping the United States out of what he called “endless wars” in the Middle East. Visiting a city with a U.S. Navy base and where many military veterans live, Trump said he wants a stronger military to project American power and bolster the United States as the leader of the world. Trump this week laid out a plan to spend many billions of dollars on bolstering the U.S. military, including more ships, planes and troops. “We’re going to put us in a position of leadership of the world again so we can negotiate from a position of great, great strength. But more important than negotiating, we will be secure again,” he said. Trump, who has drawn criticism for his frequent praise of Russian President Vladimir Putin, also mentioned a recent incident in which a Russian fighter jet came within 10 feet (3 meters) of a U.S. Navy surveillance plane over the Black Sea. “Putin laughs, believe me, he laughs at our leaders. Yesterday he had a plane 10 feet away, taunting us, toying with us, just like Iran,” he said. ","label":0},"truncated_cells":[]},{"row_idx":30,"row":{"text":"Because nothing says  justice  for Freddie Gray like a large group of teenage thugs descending on a defenseless woman and stealing her purse A producer for Ruptly, a video news service run by RT (formerly Russia Today), was robbed on camera while filming the violent protests in Baltimore overnight.The dramatic video shows the female victim first surrounded and harassed by a group of youths, who rapidly grow bolder reaching out at her, all the while hurling a stream of vulgarity and ranting about the police. She is then clearly physically attacked by the group. As the video stabilizes you see that the producer is chasing the thieves down the street trying to retrieve her stolen bag before the intervention of the Baltimore police.The protests in Baltimore over the death of Freddie Gray while in custody turned into violent riots overnight Saturday into Sunday morning. So much so that 30,000 people were locked down in Camden Yards.As Twitchy notes, at the time of the lockdown President Obama was delivering jokes to the mainstream media and assorted celebrities about a half hour away.Toward the end of the video, the woman who was robbed can be heard sobbing as she continues to film.Via: RT Ruptly","label":1},"truncated_cells":[]},{"row_idx":31,"row":{"text":"If I were a European and was forced to deal with the massive influx of Muslim refugees from Syria, I d be pointing the finger at President Obama, who clearly can t himself when it comes to caving to Iran.Foreign Affairs journalist for the Wall Street journal, Jay Solomon told MSNBC s Andrea Mitchell that Iran actually threatened to end nuke talks if Obama enforced his  red line  threat with Iran:.@WSJSolomon: Iran threatened to end nuclear talks if @POTUS enforced red line against Assad after chemical attack: pic.twitter.com/czFeFA2K10  Kenan Rahmani   (@KenanRahmani) August 22, 2016","label":1},"truncated_cells":[]},{"row_idx":32,"row":{"text":"WASHINGTON (Reuters) - With Stephen Bannon, the worry always was that he could be even more disruptive to President Donald Trump’s White House from outside than he was within. In the hours following his firing on Friday, those fears seemed warranted, as the conservative voices who viewed Bannon as one of their own howled in rage over Trump’s decision to fire his chief strategist. The reaction was most notable from Breitbart News, the hard-right news site that Bannon ran before he joined Trump’s presidential campaign last year. “WAR,” tweeted one of the site’s editors, Joel Pollak, who published a piece questioning whether Trump would now move in a more moderate direction with Bannon out of the White House.  “Steve Bannon personified the Trump agenda,” Pollak wrote. Bannon rejoined Breitbart as executive chairman only hours after his firing was announced. He is now expected to use it as a platform to blast those within the White House - and perhaps Trump himself - when they don’t hew to the fiercely nationalist policies Bannon advocated as an inside adviser. As Trump’s chief strategist, Bannon fought numerous battles with senior Trump aides and top Republicans in Congress over the administration’s policy agenda. Breitbart frequently backed him up, ripping establishment Republicans such as Senate Majority Leader Mitch McConnell and Speaker of the House of Representatives Paul Ryan, blaming them for obstructing Trump’s agenda. More recently, the site trained its fire on Trump’s national security adviser, H.R. McMaster, after he removed officials who espoused Bannon’s foreign-policy world view. In recent days, Bannon had told friends he is worth tens of millions of dollars, is a worldwide leader in the populist-nationalist movement that propelled Trump to power, and could go back to Breitbart, which he refers to as a “killing machine”, or perhaps other endeavors financed by the family of hedge-fund tycoon Robert Mercer, his longtime ally. “Steve has a powerful voice, and he’s going to keep that voice up,” said Sam Nunberg, a former Trump campaign adviser and Bannon friend. “He’s going to continue to promote policies that got Donald Trump in the White House.” Bannon had clashed with the likes of Gary Cohn, the director of the National Economic Council, and Jared Kushner, a Trump adviser and the president’s son-in-law, both of whom favored more business-friendly, mainstream economic policies on trade, taxes, and other matters. While Bannon’s ouster may mean a short-term win for the relative moderates in the West Wing, those he dubbed the “globalists,” it does not mean that policy battles on national security, immigration and the economy will dissipate. Trump has a shown a proclivity for seeking counsel from former advisers such as Corey Lewandowski and Newt Gingrich and from conservative pundits such as Sean Hannity. The outspoken and provocative Bannon could join their number. And there remain other White House officials sympathetic to Bannon’s world view, such as domestic policy adviser Stephen Miller. Even so, Bannon’s absence will be felt. “Trump is always going to be Trump on immigration, trade, and foreign policy. But Steve was the highest-ranking adviser who shared Trump’s world view. With him gone, there’s not a replacement for that voice in internal debates,” one administration official said. “I think people have always overestimated how influential anyone can be on Trump. But without Steve constantly pushing back on every policy idea coming from the so-called ‘globalists,’ it’s easy to see how they could have a chance to start winning more policy battles.” Mike Cernovich, an alt-right activist and personality, suggested to his more than 300,000 followers on Twitter that Bannon was sacked to ensure that the White House raises troop levels in Afghanistan, which Bannon opposed. “This is a full-on coup now, guys,” Cernovich said in a posted video. Beyond Breitbart and the alt-right, some more traditional conservative groups were also concerned about the implications of Bannon’s departure. Twenty Republican grassroots leaders, including longtime activists Richard Viguerie, Jenny Beth Martin, and Ginni Thomas, wrote to Trump earlier in the week urging him to keep Bannon on. “We will miss Steve Bannon in the White House because he helped President Trump keep many of the promises he made on the campaign trail,” Martin, co-founder of Tea Party Patriots, said in a statement after Bannon’s ouster. But she also reiterated her support for the president, saying “he is his own man.” If Bannon has anything to do with it, he will push to make sure that Trump stays that way.  But some supporters still worried that the radical agenda  Bannon fought for could be at risk. “It’s a sad day for the movement,” Nunberg said. “I think it will end up being a mistake.” (Corrects spelling of name in paragraph 22 to Viguerie.) ","label":0},"truncated_cells":[]},{"row_idx":33,"row":{"text":"During the Republican primaries, the biggest feud (if you don t include Donald Trump and Megyn Kelly) seemed to be between Ted Cruz and the man who is now the President Elect. Now, Cruz is one of Trump s strongest supporters. Well, he seems to be one of Trump s strongest supporters, except for the fact that Cruz can t seem to make himself say that Trump isn t a liar.In May, Cruz went on a rant calling Trump a  pathological liar,  after Trump accused Cruz  father of being involved in the assassination of John F. Kennedy. Yes, that a how insane the election of 2016 got. (Trump) doesn t know the difference between truth and lies, he lies practically every word that comes out of his mouth. Here s that somewhat surreal exchange between Cruz and the media from May:Just to recap: Trump insults not just his rival, but his rival s family. Cruz calls Trump a  pathological liar,  and now Cruz is a Trump supporter. Well, they do say politics makes strange bedfellows.Still, it appears Cruz hasn t quite let it go. On Sunday s This Week, Cruz was asked,  Do you still think Donald Trump is a liar? Cruz had no answer, other than to say,  You know, I m not going to re-litigate the past. I m going to focus on the future. I m going to focus on what s in front of us. Here s the video:While it s become the stereotype that politicians lack principles, it s apparent that for many in the Republican party, principles sell for cheap. Cruz has long been among Trump s most vocal critics, and suddenly, none of that matters because with Trump a.) Cruz sees an opportunity for a cabinet position, and b.) Cruz thinks his dream of a theocratic government will finally come true under Trump. Cruz might be right on both counts.Featured image via video screen capture","label":1},"truncated_cells":[]},{"row_idx":34,"row":{"text":"TORONTO (Reuters) - Canada will expel a Venezuelan diplomat and also bar the country s ambassador from returning, Foreign Minister Chrystia Freeland said on Monday, two days after Venezuela booted out Canada s envoy for criticizing its rights record. Western nations and Latin American neighbors have been increasingly critical of Venezuelan President Nicolas Maduro this year, accusing him of stamping on democracy and human rights.  Venezuela says foreign governments are trying to encourage a right-wing coup. On Saturday, it also expelled the Brazilian envoy. Venezuela had already withdrawn its ambassador to Canada in protest over sanctions against the Maduro regime that Canada imposed in September.  In a statement, Freeland said the ambassador was no longer welcome in Canada and that Venezuela s charge d affaires is persona non grata. Venezuela s expulsion of the Canadian diplomat over the weekend, she said, was  typical of the Maduro regime, which has consistently undermined all efforts to restore democracy and to help the Venezuelan people.   Canadians will not stand by as the Government of Venezuela robs its people of their fundamental democratic and human rights, and denies them access to basic humanitarian assistance,  she said in the statement. Canada in September, following a similar move by the United States, imposed targeted sanctions against 40 Venezuelan senior officials, including Maduro, to punish them for  anti-democratic behavior.  The ministers of defense and the interior as well as several Supreme Court judges were also among those targeted by the measures.  Canada is a member of the 12-nation Lima Group, which is trying to address the Venezuelan crisis and which next meets in Chile in January. ","label":0},"truncated_cells":[]},{"row_idx":35,"row":{"text":"BEIRUT (Reuters) - A top aide to President Bashar al-Assad said on Friday the Syrian government would fight any force, including U.S.-backed forces also battling Islamic State militants, in its drive to recapture the whole of the country. Assad has previously vowed to recapture the whole of Syria. The government controls the main urban centres in the west of the country and has taken back much of the eastern desert from Islamic State in recent months.  Whether it s the Syrian Democratic Forces, or Daesh (Islamic State) or any illegitimate foreign force in the country ... we will fight and work against them so our land is freed completely from any aggressor,  Bouthaina Shaaban said in an interview with Hezbollah s Al Manar TV. Shaaban said the U.S.-backed Syrian Democratic Forces (SDF) had captured areas from Islamic State  without any fighting , apparently accusing them of collusion with the jihadists. The SDF  are trying to get areas (where there is) oil ... but they will not get what they want,  she said. Shaaban also said plans to  divide  Syria had failed, without elaborating. The Kurdish YPG militia, which dominates the SDF, has for years controlled large parts of northeastern Syria. Advances against Islamic State in its Raqqa stronghold and a new offensive in Deir al-Zor are bringing more territory under the control of the SDF. ","label":0},"truncated_cells":[]},{"row_idx":36,"row":{"text":"The following statements were posted to the verified Twitter accounts of U.S. President Donald Trump, @realDonaldTrump and @POTUS.  The opinions expressed are his own. Reuters has not edited the statements or confirmed their accuracy.  @realDonaldTrump : - Was with great people last night in Fort Myer, Virginia. The future of our country is strong! [0646 EDT] - We pray for our fallen heroes who died while serving our country in the @USNavy aboard the #USSJohnSMcCain, and their families. [1515 EDT] -- Source link: (bit.ly/2jBh4LU) (bit.ly/2jpEXYR) ","label":0},"truncated_cells":[]},{"row_idx":37,"row":{"text":"During a recent appearance on Good Morning Britain, Donald Trump made several claims about Muslims that are, perhaps unsurprisingly to most people, completely bogus. During the interview, Trump claimed that one of the biggest challenges in the fight against terrorism is that  good  Muslims are withholding information about terrorist plots. It s like they re protecting each other,  Trump said during the interview.  They have to report the bad ones. And if you report the bad ones, then all of a sudden you re not going to have the problems. Here s the interview:This statement does not hold up to empirical evidence. Muslims do in fact quit often turn in radical extremists. Vox reports: In 2014, University of North Carolina sociologist Charles Kurzman identified 188 cases since 9/11 where the police had publicly identified a Muslim American as a suspected terrorist and disclosed where the initial tip came from. Of those 188, 54 individuals were brought to the government s attention via tips from members of the Muslim-American community. Muslim Americans were the single largest source of tips identified in Kurzman s study. To further illustrate the stupidity of Trump s claims, let s look at some other facts. Trump is implying that it is the Muslim population s responsibility to report  problems  to the authorities. By doing so he is placing responsibility for the actions of terrorists on Muslim communities  shoulders.There are approximately 1.6 billion Muslims in the world. That s about 23% of the world s entire population. Only about 3.3 million Muslims lives in the United States. During this interview, and for the entirety of his campaign, Trump has been using nearly a quarter of the world s population as a political scapegoat. The reality is that the Islamic State and other terror groups are followers of Salafi Jihadism. They are a relatively tiny cult of extremists, that mainly live in concentrated geographic regions.The chance that a Muslim person would actually know a Jihadist is pretty slim. The odds that they might stumble upon information about a possible terror plot is even slimmer. When we take that into account, and we look at the number of tips that come from Muslims about possible terror attacks since 9/11 it becomes quite clear that Muslims do almost always turn in information regarding possible terrorist activities when they come across it   and they know what they have come across.It s almost as if Muslims almost always do the reasonable thing that anyone would do if they were in that situation.Of course, none of this will probably matter to Trump or his followers. If he says he saw a video of Muslims cheering in New Jersey after 9/11, that s what they saw too. Featured image from video screenshot","label":1},"truncated_cells":[]},{"row_idx":38,"row":{"text":"The idea of a Donald Trump presidency is scary as hell for most of us. However, one Florida man has a more positive take on things. The unidentified man, who Politico reporter Michael Grunwald interviewed and described as a 32-year-old Latino Democrat, plans to vote for Trump for the most hilarious of reasons: he wants to see how nutty things can get. The man said to Grunwald: The whole system is fucked. Why not vote for the craziest guy, so we can see the craziest shit happen? To make you scratch your head even more, the man said that he voted for President Barack Obama in both 2008 and 2012, and would do so again if he could. However, he will not be tossing his vote toward Hillary Clinton this go around, because he seemingly just doesn t give a fuck. The man went on to say as to why he won t be going for Clinton in 2016: We got ISIS, we got Zika, we got this, we got that. At least Trump is fun to watch. Politics sucks, man. All I can say about this is that while his answers are funny, they are also absolutely terrifying. Donald Trump is dangerous as hell, and fun to watch right now or not, I know that I m not willing to roll the dice on the future of the nation and the world and allow that narcissistic lunatic into the White House. Now, this guy could have been fucking with the Politico reporter, but somehow I seriously doubt it. He sounds like he s more entertained by the whole Trump Train fiasco than he is frightened. Perhaps he hasn t thought this through, because if Trump wins, we ll be entering a nuclear war in short order. We ll be alienating all of our allies along the way, with likely no way to survive the absolute catastrophe that the orange buffoon would most certainly create.Hopefully, this is the only Democrat out there who is planning to vote for Trump for the lulz, because this isn t remotely funny.Featured image via Spencer Platt/Getty Images","label":1},"truncated_cells":[]},{"row_idx":39,"row":{"text":"(Reuters) - U.S. President Donald Trump met with auto executives on Tuesday and gave the energy industry a boost with action on pipelines. Highlights of the day follow: Trump signs orders smoothing the path for the controversial Keystone XL and Dakota Access oil pipelines, aiming to expand energy infrastructure and roll back key Obama administration environmental actions. Trump is expected to sign executive orders starting on Wednesday that include a temporary ban on most refugees and a suspension of visas for citizens of Syria and six other Middle Eastern and African countries, according to several congressional aides and immigration experts briefed on the matter. Trump urges the chief executives of General Motors Co, Ford Motor Co and Fiat Chrysler Automobiles NV to build more cars in the country. Trump signs an executive order directing that the permitting process and regulatory burden for domestic manufacturers should be streamlined to reduce what he calls an “incredibly cumbersome, long, horrible” system.     The Environmental Protection Agency and the Agriculture Department will hold off on some rules as part of a freeze on regulations imposed by the Trump administration, trade groups say.         Trump’s administration has moved since last week to curb the flow of information from several government agencies whose mandate affects environmental issues, in actions that appear designed to tighten control and discourage dissenting views. {nL1N1FE5FE] Trump, poised to restore the Supreme Court’s conservative majority, says he will announce his choice next week to fill the seat left vacant since the death of conservative Justice Antonin Scalia more than 11 months ago, with three federal appeals court judges among those under close consideration. Trump intends to retain FBI Director James Comey amid reports that law enforcement and intelligence agencies are scrutinizing Trump associates over their ties to Russia. The U.S. Senate votes overwhelmingly to confirm South Carolina Governor Nikki Haley as ambassador to the United Nations. Representative Tom Price, Trump’s nominee for health secretary, tells a Senate panel he wants to ensure people with pre-existing conditions have access to insurance and he does not support Medicare privatization. Mexico could pull out of the North American Free Trade Agreement if a renegotiation of terms does not benefit the country, its economy minister says. The White House says Trump stands by his belief that millions of people voted illegally in the presidential election but offered no evidence to support the contention. ","label":0},"truncated_cells":[]},{"row_idx":40,"row":{"text":"The White House is finally wising up and realizing that America s current president is a toddler, and Donald Trump literally cannot be left alone for a moment because he might further incriminate himself or cause another PR disaster.Many people have remarked that while Trump s first overseas trip has been filled with several embarrassing moments and blunders, his activity on Twitter has been uncharacteristically calm. There s a reason for that, and it might become a more permanent thing in the future.According to the Wall Street Journal, Trump s Twitter account may be going under a sort of lockdown that could be implemented long term. This includes a team of lawyers whose sole task is to vet Trump s Twitter activity to make sure he doesn t make himself or his administration look bad. Seriously, how sad is it that a POTUS has so little self control that he needs a team of lawyers to monitor his social media activity?! This is what the WSJ reported:One major change under consideration would vet the president s social media posts through a team of lawyers, who would decide if any needed to be adjusted or curtailed. The idea, said one of Mr. Trump s advisers, is to create a system so that tweets  don t go from the president s mind out to the universe. In its report, the WSJ gave some cringeworthy examples of how Trump s tweets have gone astray, such as the time he accused former president Barack Obama of  wiretapping  him, and the time he implied that his conversations with former FBI Director James Comey were taped.Former campaign aide Barry Bennett doubts that this plan will work, as he said  I would be shocked if he would agree to that  when told about Trump s proposed Twitter surveillance. However, that s not all the lawyers will be sought out for. It s being reported that Trump will also meet with attorneys to  help deal with the legal ramifications of the Russia investigation.  Lord knows Trump needs all the help he can get.Featured image via Pool / Getty Images","label":1},"truncated_cells":[]},{"row_idx":41,"row":{"text":"NEW YORK - Democrat Hillary Clinton plans to pour half of her presidential campaign’s budget into advertising in the first three months of this year as she seeks to fend off an increasingly tough challenge from chief rival Bernie Sanders, according to a summary of her spending plans reviewed by Reuters. The first-quarter advertising blitz would represent almost a doubling of the proportion of money that the campaign devoted to such spending, on average, during 2015.  The report, prepared by her team’s finance committee, aims to paint a picture of a fiscally prudent campaign operation that has been spending heavily on digital tools and organizing last year and is now ready to ramp up ad spending as the 2016 White House race moves into a critical new phase. “The significant early resources mobilized by our Finance Committee in 2015 helped us make smart early investments in key areas – and will enable us to continue with strategic allocations in Q1 of 2016,” the report reads. The first quarter is a crucial period in the presidential nominating contest. It kicks off with the Iowa caucus on Feb. 1, followed by the New Hampshire primary on Feb. 9 and a series of other early votes through March, including “Super Tuesday” on March 1 when 11 states hold nominating contests.  Many of the contests during March, the report notes, “are in big states with expensive media markets.” In 2015, the campaign devoted nearly 10 percent of its spending to technology and digital tools, about a fifth of the budget on list-building and almost another quarter on state organizing, according to the year-end document. List-building refers to amassing names of potential voters who a campaign wants to woo. The Clinton campaign declined to comment on the spending report. The increased focus on advertising spending comes as the campaign expects to shrink the ratios of spending in other areas, especially those that appear related to infrastructure. State organizing, for example, is projected to go from 23 percent in 2015 to 18 percent in the first quarter of this year. List-building is expected to go from 21 percent in 2015 to 14 percent in the first three months of 2016. The report comes two weeks before the Iowa contest, with Clinton locked in a tightening race with Sanders, the fiery U.S. senator from Vermont who has been drawing big crowds in the early-voting states with his calls to crack down on Wall Street.  The emphasis on fiscal prudence is part of a broader effort by the Clinton campaign to reassure supporters that it has learned from her 2008 campaign, which was plagued by missteps, including a failure to match the organizational and digital prowess of Barack Obama, who ultimately won the Democratic nomination - and the general election.  Clinton’s campaign raised more than $112 million last year for the primary fight, according to a previously released statement from Jan. 1. That includes $37 million raised in the fourth quarter. The campaign had nearly $38 million in cash on hand headed into this year, according to the statement. The year-end report only notes budget categories as a percentage of total spending and does not include dollar amounts for categories or line items. Nor did the document include a dollar amount for the overall budget. Through the third quarter of last year, the campaign spent more than $12 million on direct marketing, online ads and media buys, according to campaign finance filings.  Federal Elections Commission filings for the fourth quarter for all presidential campaigns are due Jan. 31.  (Additional reporting by Emily Flitter and Grant Smith; Editing by Caren Bohan and Leslie Adler) SAP is the sponsor of this coverage which is independently produced by the staff of Reuters News Agency.","label":0},"truncated_cells":[]},{"row_idx":42,"row":{"text":"(Reuters) - U.S. airline Alaska Airlines on Tuesday said it would discontinue a daily flight between Los Angeles and Havana, Cuba, after Jan. 22, due to the recent changes in Cuba travel policies by the U.S. government. The U.S. government made it tougher last week for Americans to visit Cuba and do business in the country, making good on a pledge by President Donald Trump to roll back his Democratic predecessor s move toward warmer ties with Havana.  The regulations include a ban on Americans doing business with some 180 Cuban government entities, holding companies, and tourism companies. The airline which started the Los Angeles-Havana flight in January this year, said it will redeploy the aircraft to other markets with stronger demand.   Passengers who have tickets booked to Havana after January 22 will be rebooked on another airline at no additional cost or a full refund, the company said. ","label":0},"truncated_cells":[]},{"row_idx":43,"row":{"text":"Steve Bannon is portrayed as the Grim Reaper on Saturday Night Live. There is a  President Steve Bannon  meme out there from coverage of the controversial advisor. In reality, his influence seems to be headed nowhere but down. First, he totally blew President Donald Trump s health care initiative. Then, his influence waned further when he openly seemed to fight with son-in-law Jared Kushner and urged the president to not take action in Syria. Now, Trump has even backpedaled on this demands that Congress fund the wall between the United States and Mexico, against the wishes of Steve Bannon.The border wall with Mexico was a big part of the Trump campaign. All of his rallies included a session of chanting with the audience of  Build the Wall!  For his part, Trump never acknowledged that Mexico is never going to pay for this expensive wall. It is also part of Bannon s dreams for the United States. His worldview, which was front and center during the president s Inaugural Address, needs this wall.Bannon is so enamored by the wall that he was pushing for a government shutdown to get Congress to include funding for it. Clearly, he learned nothing from the healthcare debacle where he told Trump to try to strong arm Congress into passing their bill because Trump wanted them to. Bannon s lack of experience dealing with our legislative branch is clear. As a co-equal branch of government, its members are never going to do something just because the White House tells them to. If you are thinking Senator Majority Leader Mitch McConnell (R-KY) pushed through Neil Goresuch s nomination because of this kind of work, you miss the win it gave McConnell.This week, Bannon told his supporters,  This is a stand worth taking. We re drawing a line in the sand. It looks more and more like Bannon is going to be alone drawing that line as if you didn t think his days in the West Wing were numbered before, it is more than clear that they are now.Featured image via Win McNamee/Getty Images.","label":1},"truncated_cells":[]},{"row_idx":44,"row":{"text":"Am I the only one who feels like I m living in the  Twilight Zone  when I hear Nancy Pelosi begin a discussion about a certain threat to our national security by saying,  I m the top Democrat on the Intelligence Committee . Her admission to being a key figure on our House Intelligence Committee should scare every single American, no matter what political party you identify with.Listening to this woman talk only underscores the urgency of cleaning house in Washington this November. Listen to her call Hillary s reckless decision to leave top-secret classified emails open to hackers around the world a  technical error . Our national security is at risk over a crooked Secretary of State who deliberately set up a separate email server to hide goodness knows what and the  top Democrat on the Intelligence Committee  calls it a distraction from Zika?","label":1},"truncated_cells":[]},{"row_idx":45,"row":{"text":"Time will tell how serious the House Republicans are about keeping our nation safe. Goodness knows it s the furthest thing from our  Climate Change Promoter In Chief s mind Following the deadly terrorist attacks in Paris, House Republicans are proposing to block federal funding for resettling Syrian refugees until a series of new conditions are met, Foreign Policy has learned.The growing momentum behind new legislation, still being drafted, sets up a future clash between the White House and Congress as the Obama administration seeks to offer residency to 10,000 Syrian refugees who currently live outside the conflict zone. Currently, 60 million people worldwide have been forced from their homes or are otherwise considered refugees   higher than at any other time in recorded history. An estimated six million to eight million displaced people are still in Syria, and more than four million Syrian refugees are in Jordan, Turkey, and Lebanon.The draft legislation, a copy of which was obtained by FP, is backed by Reps. Brian Babin, Lou Barletta, Diane Black, Mo Brooks, Jeff Duncan, John Duncan, Blake Farenthold, Louie Gohmert, Frank Guinta, Gregg Harper, Walter Jones, Steve King, Mike Pompeo, Mark Meadows, and Bill Posey. It would prevent funding for the resettlement of refugees from the Middle East and North Africa until authorities adopt  processes to ensure that refugee and related programs are not able to be co-opted by would-be terrorists.  Once those processes are in place, details of the security checks must be given to Congress in both classified and public forums, and the administration must establish a  longer-term monitoring process  to track refugees in the U.S.The 15 Republican lawmakers pushing the legislation aren t the only politicians looking to slam the brakes on Obama s resettlement program. The governors of 15 U.S. states have already said they would not allow Syrian refugees to live in their states. Alabama Senator Jeff Sessions (R) has proposed legislation to restrict U.S. funding for refugee resettlement and Kentucky Senator Rand Paul (R) has said he will introduce legislation to prevent Syrian refugees from obtaining U.S. visas.Additionally, House Homeland Security Chairman Michael McCaul plans to raise the issue of blocking Syrian refugee resettlement at a Tuesday meeting with fellow Republicans, according to two congressional sources.In a Monday letter to President Barack Obama, McCaul called on the White House to immediately  suspend  the admission of all additional Syrian refugees. The high-threat environment demands that we move forward with greater caution in order to protect the American people and to prevent terrorists from reaching our shores,  McCaul wrote.The rising opposition to assisting Syrian refugees is already alarming humanitarian organizations, which say that doing so defies America s long tradition of helping individuals fleeing persecution. A senior Obama administration official, speaking to FP on condition of anonymity, said security concerns about incoming refugees were unfounded   in large part because they undergo  the highest level  of scrutiny by intelligence and security government agencies. All refugees, including Syrians, are admitted only after successful completion of this stringent security screening regime,  the official said.Fears about taking in refugees spiked after a Syrian passport was found near the body of one of the assailants in the deadly Paris attacks that killed at least 129 people. Questions remain, however, over the identity of the attacker: French officials on Monday said he used a fake Syrian passport to travel to Europe through Greece and the Balkans. While his actual identity is unknown, the attacker is believed to have posed as a Syrian refugee to enter Europe through the Aegean Sea. Via:Foreign Policy","label":1},"truncated_cells":[]},{"row_idx":46,"row":{"text":"From the Vanity Fair article: Milo Yiannopoulos, the former tech editor at Breitbart, has made political provocations, often deeply offensive ones, a business model. But his career seemed to come crashing down in recent months when one of his speaking appearances, at the University of California, Berkeley, led to riots. Weeks later, videos emerged of Yiannopoulos seeming to condone pedophilia. ( I do not support pedophilia. Period. It is a vile and disgusting crime, perhaps the very worst,  Yiannopoulos said in a statement on Facebook at the time.)Yet his allies turned on him. Yiannopoulos was subsequently forced out of Breitbart in disgrace. The American Conservative Union disinvited him from CPAC, and Simon & Schuster canceled a six-figure book deal.But as the free-speech conflagration he ignited at Berkeley continues to burn, Yiannopoulos is planning a way back in. Days after releasing a video touting his return to the campus, Yiannopoulos told the Hive that he would be launching a new media venture in the coming weeks with what he says is a $12 million investment from backers whose identities he is protecting. (Yiannopoulos showed me a page from the contract with the investors  names blacked out.) Another person involved with the company, who spoke on the condition of anonymity, was similarly secretive:  Milo has the best instincts about these things,  he said.The business, which will be called Milo Inc., will be even more focused on stoking the sort of ugly political conflict that s closer to the surface of what can be best described as corporatized trolling via live entertainment, with Yiannopoulos and his investors hosting events featuring right-wing talent.  The business of Madonna became touring,  said Yiannopoulos in a phone interview, citing the artist s deal with Live Nation.  I m doing the same thing, but instead of signing up with Live Nation, I m building one. I m building it for libertarian and conservative comedians, writers, stand-up comics, intellectuals, you name it. This video pretty much sums up the truth about Milo and his free-speech rights being shut down by violent leftists:Milo Inc. s first event will be a return to the town that erupted in riots when he was invited to speak earlier this year. In fact, Yiannopoulos said that he is planning a  week-long celebration of free speech  near U.C. Berkeley, where a speech by his fellow campus agitator, Ann Coulter, was recently canceled after threats of violence. It will culminate in his bestowing something called the Mario Savio Award for Free Speech. (The son of Savio, one of the leaders of Berkeley s Free Speech movement during the mid-1960s, called the award  some kind of sick joke .)For the entire article: Vanity Fair ","label":1},"truncated_cells":[]},{"row_idx":47,"row":{"text":"The double-talk that spews forth from King Cheeto s mouth is astonishing, if for no other reason than so many people believe all of it. He s a liar, he s a hypocrite, he s an autocrat, he s a narcissist. And he promises to continue talking out of both sides of his mouth the same as he did on the campaign trail.And his audiences will continue to eat up every syllable. Why on earth do they do that? Matt Bai, a political columnist at Yahoo! News, boils it down to this one sentence: Trump is a pure opportunist, a pitch-perfect crooner of whatever note resonates.  [emphasis mine]BOOM! There it is, right there. Trump knows exactly what will make people respond favorably to him and he says it. In doing so, he renders anything he said before irrelevant, no matter how contradictory. Look at all his cabinet picks that followed his promise of  draining the swamp  of Washington insiders, elites and cronies. His cabinet is Wall Street bankers. It s establishment politicians. It s members of the very same military leadership he called stupid during his campaign.Trump embodies a type of leader known as the  charismatic leader,  and that s not necessarily a good thing. True, not all charismatic leaders are bad, but they aren t all good either. In Trump s case, this is a very bad thing. In Management Today, columnist Adam Gale says the world that Trump comes from is one where  force of personality is more important than collaboration or cold reasoning. That s all that matters, and why we re suddenly living in a post-fact world. Facts, truths, and reason don t matter if Trump can convince people they don t matter. And he himself admitted to playing his audiences like the violins they re not in The Art of the Deal: I play to people s fantasies. People may not always think big themselves, but they can still get very excited by those who do. That s why a little hyperbole never hurts.  [emphasis mine]Think he won t do that as President? Think again   he s already done it. His loyal subjects still bleat about how amazing he is to have struck a deal with Carrier to keep jobs here in the U.S. They completely ignore the facts that Carrier is still sending jobs to Mexico and is planning to raise prices. They don t seem to care that they re going to automate their Indiana plant, which will destroy some of those jobs Trump supposedly saved so they can keep their costs down. Their parent company s CEO, Greg Hayes, said that outright: We re going to automate to drive the cost down so that we can continue to be competitive. Is it as cheap as moving to Mexico with lower cost labor? No. But we will make that plant competitive just because we ll make the capital investments there. But what that ultimately means is there will be fewer jobs. In the case of the Carrier deal, Trumpkins  specific fantasy is the idea that Trump can coerce, cajole, and even strongarm companies, one by one, into not only keep jobs here, but also into at least maintaining their current workforce, or adding more jobs. The fantasy is that Trump is going to be able to erase every individual s personal economic distress.That s impossible, but that s what they see through their rose-colored glasses. There are other fantasies, too, like this: My whole life I ve been greedy, greedy, greedy. I ve grabbed all the money I could get. I m so greedy. But now I d like to be greedy for the United States. Washington Post columnist and The Nation publisher Katrina vanden Heuvel hit the nail of that Trumpkin fantasy on the head with this: It was a compelling story: the rapacious mogul turned Robin Hood, setting out to reform the rigged system that made him rich in the name of the common good. She went on to describe how that s an illusion that Trump has created for his faithful subjects, but which his actual policy positions during his campaign should have shattered.This is how Trump s followers can keep right on crowing about Trump s awesomeness and how he s the president we need to be great again. One could even say that they re brainwashed in a very real way (they also seem to be too stupid to see how stupid they are, but that s a different subject).Oh sure, there are a few who are angry. There are a few who have woken up. Former Congressman Joe Walsh, of Illinois, is one such person (and agreeing with that man on anything at all makes us feel like we re in a bizarre alternate reality where night is day, hell is cold, and dragons really do exist, but, well, there it is).Sarah Palin called out his deal with Carrier as crony capitalism.But so many others? They re on social media being as trashy as ever toward the press, toward Democrats, toward anyone who doesn t march exactly to Trump s drumbeat. They re calling any news that doesn t reinforce the golden crown they see on Cheetolini s head  fake news,  and completely ignoring how many campaign promises Trump has already broken. They trust him implicitly because he knows exactly how to sing their tune in perfect time and pitch. Whether he means it is irrelevant.And he ll keep right on playing them. Bai said he ll do it until someone can prove to him that there s a real cost. Bai is right.Featured image by Chip Somodevilla via Getty Images","label":1},"truncated_cells":[]},{"row_idx":48,"row":{"text":"Donald Trump is being graded on a curve. He always has been, as he has broken every rule in the political handbook and still managed to lie, cheat, and insult his way to the presidency. However, on Tuesday night, he delivered a speech to a joint session of Congress   his first. For the most part, he stuck to his prepared remarks, and he seemed to keep his attention span and his temperament in check. There were no nasty insults to the press, to Democrats, or to Republicans who have been critical of him. Compared to the wild, unhinged antics we ve been treated to from Trump since the day he launched his disgusting presidential campaign, this speech was surprisingly normal by Trumpian standards. This seems to be good enough for cable news personalities at this point.But, one #NeverTrump conservative, Charlie Sykes, has news for said pundits: They are looking too hard for Trump to act like a normal president   or even a normal human being   and in turn they are behaving like abused spouses. Appearing on MSNBC, Sykes said of the punditry surrounding Trump s speech: There s almost a  battered pundit syndrome  going on out there. He comes home and he s not abusive, and he s not drunk, and so we re just so incredibly grateful, it s just so incredibly good. Sykes went on to remind people that Trump s  new tone  is unlikely to go beyond that speech. He ll be back to his old, unruly self again in no time   just like a drunken, abusive spouse. To that end, we, the American people, need to treat him like an abuser, because that is just what he is, only on a grand scale.Thank you, Mr. Sykes, for reminding everyone just who and what Trump is. Splashes of seeming normalcy from him should not be treated as if the storm has passed. It will never pass with this man.Watch the exchange below:Featured image via video screen capture","label":1},"truncated_cells":[]},{"row_idx":49,"row":{"text":"It s no secret Hispanics hate Donald Trump. He has record low favorability with them, and there are no signs that support with them will rise in the coming months. GOP Hispanic leaders and pundits alike, from Republican governor Susana Martinez to CNN s Ana Navarro, have been chastising and distancing themselves from the Republican nominee for President.And another influential Hispanic group is distancing themselves from the nominee in the most public way possible.The Hispanic Chamber of Commerce, which endorsed Ohio governor John Kasich, will be publicly backing Democratic candidate Hillary Clinton, and will announce their endorsement live from Cleveland at the RNC.Talk about the ultimate trolling.President of the Chamber, Javier Palomeraz, denounced Trump to the Huffington Post, saying his divisive and racist rhetoric is the reason the group will be backing Clinton:We believe it is appropriate for us to weigh in and say enough is enough   What we re hearing from Donald Trump in his campaign: divisive, mean-spirited language [that] has marginalized Hispanics, immigrants, American POWs, Muslims, women, the disabled   and the list goes on.After public spats with Palomeraz, in which Trump cancelled events planned, the Clinton campaign was right there to attend, listen, and learn about the needs of Hispanic business owners. The Clinton campaign also was repeatedly in touch with the Chamber in an effort to reach out to communities using a slew of business leaders familiar with their needs.No wonder they re endorsing Clinton. It s no secret that the U.S. Chamber of Commerce is pro-Republican, pro-Conservative. But their opinion isn t the only representation of business in America.While Trump flunks the presidential test (yet again), Clinton picks up the pieces and offers her hand in support. It s no wonder more unions and business leaders have endorsed her than Trump. The Republican nominee looks out for one person and one person only   himself.Featured image via Ethan Miller/Getty Images","label":1},"truncated_cells":[]},{"row_idx":50,"row":{"text":"WASHINGTON (Reuters) - The U.S. Senate Judiciary Committee will hold its confirmation hearing for President Donald Trump’s U.S. Supreme Court nominee, conservative federal appeals court judge Neil Gorsuch, beginning on March 20, the panel’s Republican chairman said on Thursday. The hearing is likely to last three to four days, with Gorsuch and committee members making opening statements on the first day, the nominee facing questions on the second day and outside experts also testifying, Senator Chuck Grassley said. Grassley said in a statement that Gorsuch, nominated by Trump on Jan. 31, has so far “met every demand” posed by Democrats, who are the minority party in the Senate but can still delay action if they can muster enough votes. “He’s a mainstream judge. He’s displayed independence. He’s met with dozens of senators who have nothing but positive things to say. He is well-qualified and respected,” Grassley said. Supreme Court nominees require Senate confirmation for the lifetime job on the nine-justice court. With four liberals and four conservatives now on the court, Gorsuch’s confirmation would restore the conservative majority that had existed for decades until the February 2016 death of Justice Antonin Scalia. Democrats, still furious over the Republican-led Senate’s refusal last year to consider Democratic President Barack Obama’s nominee Merrick Garland to replace Scalia, have raised questions about whether Gorsuch would be willing to demonstrate independence from Trump if confirmed to the job. In light of Trump’s pointed criticism of judges who ruled against him in the past, Democrats are likely to question Gorsuch about the importance of an independent judiciary. After courts put on hold Trump’s ban on people entering the United States from seven Muslim-majority countries, the president criticized the proceedings as “disgraceful,” called one of the jurists a “so-called judge” and labeled the judiciary “so political.”  Democratic Senator Richard Blumenthal said last week Gorsuch told him during a private meeting that Trump’s comments about the judiciary were “disheartening and demoralizing,” an account that Gorsuch’s spokesman, Ron Bonjean, confirmed but Trump disputed. The Senate’s top Democrat, Chuck Schumer, last week accused Gorsuch of avoiding answering questions “like the plague” during their private meeting and dodging efforts to gauge his judicial independence. Trump’s fellow Republicans control the Senate 52-48 but Schumer has insisted Gorsuch would need to win 60 votes, rather than a simple majority, to move toward confirmation. Democrats can seek to use a procedural maneuver to block a confirmation vote if Gorsuch’s supporters cannot muster 60 votes, although Republicans could change the Senate rules. If the hearing goes smoothly and the full Senate votes to confirm him soon afterward, Gorsuch could be on the court before the end of the court’s current term in June. ","label":0},"truncated_cells":[]},{"row_idx":51,"row":{"text":"Let s hope this angry leftist mayor doesn t prevent individual donors from contributing to help the people of San Juan who may not agree with her hateful attacks on our President, who is bending over backward to get the help to the victims of the hurricane.Is anyone else sick and tired of hearing this mayor whine about everything America is NOT doing for her? San Juan Mayor Carmen Yulin Cruz, who has refused to participate in any FEMA meetings regarding aid to Puerto Rico in the aftermath of Hurricane Maria, has continually accused the Trump administration of not helping out in Puerto Rico s time of need, going so far as to claim the federal government is  killing  Puerto Ricans.Fox News  Geraldo Rivera went down to Puerto Rico and actually confronted Cruz about her statement that people are  dying  because of the Trump administration s  inefficiency and bureaucracy. But are people dying? I ve been traveling around, I don t see people dying,  Rivera challenging Cruz said.  I spoke to the doctors, they say they saw 53 patients and they had a person who was septic, but nobody dying. Dying is a continuum,  Cruz said in response.  If you don t get fed for seven, eight days and you re a child, you are dying. If you have 11 people like we took out of a nursing home, severely dehydrated, you are dying. Of course dying is a continuum. Everyone eventually dies. It s an unfortunate part of life. But, when it comes to Puerto Ricans dying from neglect and a lack of supplies, Rivera wasn t buying it. The death count was 16 a week ago. It remains 16 today,  Rivera said.  People are not dying. Here s the video of Rivera s interview with Cruz:Backing up Rivera s claims, an article released on Sunday by the Daily Mail said that a Puerto Rican woman claiming to be a police officer alleged that Cruz and Puerto Rican Governor Ricardo Rossello have been holding back supplies  in order to make for better photo opportunities. The woman even went so far as to say that U.S. armed forces need to  come in and distribute the aid. Via: MRCTV","label":1},"truncated_cells":[]},{"row_idx":52,"row":{"text":"MOSCOW (Reuters) - Bomb threats forced thousands of people to evacuate Moscow s Bolshoi theater, Metropol hotel, GUM department store on the Red Square and other public places on Sunday, local media reported. A spate of anonymous phone calls have caused disruption at shopping centers, train stations and public buildings across Russia in the past two months. The calls have so far proved to be false alarms and there have been no claims of responsibility. RIA news agency, citing a source in the police, reported that as many as 5,000 people were evacuated from GUM and Metropol hotel. TASS and RIA, also quoting police sources, said the Bolshoi theater was also evacuated. A Reuters witness said police had cordoned off premises of Bolshoi and GUM. TASS said the evacuation was announced from Bolshoi before a performance was due to start at 1600 GMT.  Alexander Bortnikov, the head of the FSB security service said last month the authorities knew the identities of those responsible, saying they four Russian citizens based abroad with  accomplices  inside Russia.  ","label":0},"truncated_cells":[]},{"row_idx":53,"row":{"text":"WASHINGTON (Reuters) - In its latest move to combat climate change, the Obama administration on Friday said it will overhaul 30-year-old regulations for oil and gas operations on public and tribal lands to limit the “wasteful release” of natural gas and curb methane emissions.  The proposal by the Interior department’s Bureau of Land Management would require oil and gas producers to use currently available technology to limit flaring at oil wells on federal land. It would also require operators to regularly check for natural gas leaks and replace outdated equipment that allows large quantities of gas and methane to escape into the air.  The overhaul would also clarify when oil and gas companies need to pay royalties on flared natural gas.   “These updated regulations, which would be phased in over several years ... would not only get more of our nation’s natural gas into pipelines and delivered to market but also reduce pollution and cut greenhouse gas emissions that are contributing to climate change,” Assistant Secretary for Land and Minerals Management Janice Schneider said.  The proposal comes as a major methane leak from a natural gas storage site near Los Angeles has forced thousands of people to evacuate their homes for months and put a spotlight on emissions oversight. The BLM overhaul would only affect federal land. The overhaul would reduce flaring by up 60 percent and venting by up to 46 percent compared to 2013 rates. The BLM estimates that it would prevent the loss of up to 56 billion cubic feet of gas a year through venting, flaring or leaks, which could supply around 760,000 households annually.  The agency said it would also avoid methane emissions that would be equivalent to up to 4.2 million metric tons of carbon dioxide emissions per year.  Methane is the second most prevalent greenhouse gas after carbon dioxide. Though it only lasts in the atmosphere for 20 years, methane is 84 times more effective than carbon dioxide at trapping heat, and environmental groups have pressed the administration for tighter restrictions on leaks. Energy industry groups and some Republican lawmakers blasted the rule, announced as Washington prepares for a major blizzard, arguing that it deprives states of needed revenue and duplicates voluntary efforts by companies to reduce waste.   “Another duplicative rule at a time when methane emissions are already falling and on top of an onslaught of other new BLM and EPA regulations could drive more energy production off federal lands,” said Erik Milito, director of upstream and industry operations at the American Petroleum Institute. The overhaul forms part of the broader Obama administration strategy announced last January to reduce oil and gas sector methane emissions by up to 45 percent from 2012 levels by 2025. The strategy includes an Environmental Protection Agency proposal announced in August targeting methane emissions from new or modified oil and gas processing and transmission facilities and wells. It comes on the heels of a BLM announcement last week that it will freeze new leases for coal production on public land. ","label":0},"truncated_cells":[]},{"row_idx":54,"row":{"text":"SEOUL (Reuters) - A senior United Nations human rights official on Thursday said he was investigating North Korea s allegations that a dozen restaurant workers who arrived in the South from China last year were abducted against their will. Tomas Ojea Quintana, the U.N. special rapporteur on human rights in North Korea, said he spent part of a four-day visit to Seoul looking into the claims surrounding the biggest mass defection case involving North Koreans in several years.  I have received testimony taken by people in my office that shows inconsistencies in what may have happened,  Quintana told a news briefing. North Korea says the 12 waitresses were abducted, and a manager who defected with them tricked them into making the journey. It has demanded the return of the women, but officials in Seoul say they traveled voluntarily and were admitted on humanitarian grounds. Some of the workers are now university students, according to several sources who have met them, but all have kept a low profile and mystery still surrounds their trip. Relatives in the North had also raised objections, Quintana added.  I was told the father of one of these women recently passed away without meeting his daughter, adding to a long list of victims who continue to pay the absurd cost of division,  he said. The briefing was briefly interrupted by Kim Ryon Hui, a woman who said she had been forcibly held in South Korea for seven years. Quintana said he had met Kim the previous day, but did not have the authority to comment on human rights issues in South Korea. North Korean officials have said the 12 waitresses and Kim must be allowed to return before they allow family visits to resume. In an interview with Reuters in November, Kim said she first arrived in the South to seek a better job, without realizing her return home would be blocked by its laws that the government must approve visits to, or contact with, the North. Allowing Kim s permanent return would violate the law, says the South s Ministry of Unification, which estimates 881 defectors to have arrived from the North this year. Quintana urged that international sanctions imposed on North Korea over its nuclear weapons program be tailored to avoid any adverse impact on human rights and economic livelihoods. Restrictions on international financial transfers, for example, should not affect U.N. programs that provided humanitarian assistance, he said.  While Pyongyang has condemned the sanctions, Quintana called for the government to  substantiate its criticism with substantive data , and provide access for international human rights monitors. Impoverished North Korea and the rich, democratic South have been in a technical state of war since their 1950-53 conflict ended in a truce, not a peace treaty. A North Korean soldier who defected to the south in November was shot five times by border guards and critically wounded in his desperate dash through the demilitarized zone dividing the two.  ","label":0},"truncated_cells":[]},{"row_idx":55,"row":{"text":"There s an age-old question that has been haunting the American people for several decades now   is Donald Trump s hair real? And if it is real, how does it do what is does? And if it isn t real, where does he get it from?Well, folks, we may finally have our answer. It looks as though a Donald Trump  wig farm  has been spotted along the coastline of Troms , Norway. And of course he would outsource his hair to another country   what a hypocrite.Just kidding! The  hair  is actually just a form of bunch grass, but the resemblance to whatever that is on top of Trump s head is remarkably uncanny.There s currently a ridiculously hilarious video making the rounds from VGTV out of Norway that has been asking this hair-raising question. They, of course, explain what it actually is you are seeing, but the video itself it pretty damn gut-busting as they super-impose video and images of Trump defending himself over and over, telling people his hair is, in fact, real. Although, with as much lying as the Republican front-runner has been doing lately, who knows, really?Let s just say this is a nice break in the monotony of the insane that we ve had to endure for the past few months.Enjoy!Watch the silly video explaining it all here:Featured image via video screen capture  Scott Olson/Getty Images","label":1},"truncated_cells":[]},{"row_idx":56,"row":{"text":"(Reuters) - UK Prime Minister Theresa May s conservative party is leading in polls for the first time since the June election, according to a YouGov poll for the Times. Theresa May s advantage over Labour party s Jeremy Corbyn has doubled, the newspaper said. The YouGov poll, conducted on Sunday and Monday among 1,680 adults, suggested that May s Brexit deal appears to have improved her public standing and pushed the Tories ahead on 42 per cent with Labour at 41 per cent of the vote.  Liberal Democrats were at 7 per cent and the rest on 10 per cent, Times said. The public still does not think that the government is doing a good job on Brexit, but, Theresa May was the preferred choice for  best prime minister  with 37 percent of the votes. Only 28 percent voted for Jeremy Corbyn. The paper added that public did not shift its view on the referendum with 44 percent saying that Britain was right to vote to leave, and, 45 per cent said it was the wrong choice. ","label":0},"truncated_cells":[]},{"row_idx":57,"row":{"text":"WARSAW (Reuters) - British Prime Minister Theresa May gave Poland a rare dose of big power support on Thursday by saying that its constitution was its own affair, a sharply different tone to that of the European Union which has scolded Warsaw over judicial reforms. The EU executive launched an unprecedented action against Poland on Wednesday, calling on other EU member states to prepare to sanction Warsaw if it fails to reverse judicial reforms that Brussels says pose a threat to democracy. When asked about the Commission s move to deploy the  nuclear option  under Article 7 of the 2009 Lisbon treaty, May said:  These constitutional issues are normally, and should be primarily a matter for the individual country concerned.  Speaking alongside Polish Prime Minister Mateusz Morawiecki in Warsaw, May said:  Across Europe we have collective belief in the rule of law.    I welcome the fact that Prime Minister Morawiecki has indicated that he will be speaking with the European Commission and I hope that that will lead to a satisfactory resolution.  While the EU executive has censured Polish ruling party leader Jaroslaw Kaczynski s push to have control of judicial appointments, May is seeking to court Poland as an ally in Brexit negotiations and key military partner against Russia. Poland has said reforms are necessary while like-minded allies in Hungary have indicated they will veto the ultimate sanction of suspending Poland s voting rights in the bloc. At one point, a translator s slip made Morawiecki appear to cast May as  Madame Brexit , though in fact he said in Polish:  as Madame PM said, Brexit is Brexit . May said Britain and Poland had signed a defense and security cooperation treaty which deepens cooperation on training, information sharing and capability development. On the eve of a visit by Foreign Secretary Boris Johnson to Moscow, May said Vladimir Putin s Kremlin was trying to weaponise information and undermine a rules-based international system.  We are both deeply concerned by Russia s attempts to weaponise information,  she told reporters.  The Kremlin is seeking to undermine the international rules-based system and it will not succeed.  Morawiecki said he hoped France and Germany were aiming to work out the best solution with Britain as it leaves the EU  I have deep hopes and conviction that our French and German partners aim to work out the best solution in this new, not easy situation that we are in with respect to Brexit,  Morawiecki said. ","label":0},"truncated_cells":[]},{"row_idx":58,"row":{"text":"Former Secretary of State Condoleezza Rice sat down for an interview on Sunday and had a few words to say about the birth of America, which was plagued by slavery from its very conception.While discussing her newest book, Democracy: Stories from the Long Road to Freedom,  Rice told CBS  Sunday Morning that the Civil Rights Movement of the 1960s was the second founding of America. We forget in the United States how long it has taken us to make  We the People  mean people like me. And indeed, I do think that America was born with a birth defect; it was slavery. And so I do think that when we were finally able to deliver the promise of the Constitution to people like me, little girls growing up in Birmingham, Alabama, when finally my father was able to vote without difficulty, yes, it s the second founding of America. The first founding wasn t quite complete. Rice, who spent eight years in the White House serving as national security adviser and secretary of state under President George W. Bush, also called forth a memory from her childhood during the interview. She grew up in Alabama, where Jim Crow was the law of the land. In the summers, her family would travel to Denver. However, these were not your average family vacations. Rather, they were a quest for an education denied to them because of the color of their skin. If you were black, you couldn t go to the University of Alabama for graduate school in 1961,  she said.  And so my father, who was getting an advanced degree in student personnel administration, and my mother, who was qualifying to teach music in the schools   she was a science teacher before that   would go to Denver. You can watch her interview in its entirety here, via CBS Sunday Morning.Featured image via video screen capture","label":1},"truncated_cells":[]},{"row_idx":59,"row":{"text":"Two anti-abortion activists are facing 15 felony charges after they secretly filmed themselves trying to buy aborted fetal tissue from Planned Parenthood. (In case you missed it, these attempts were unsuccessful because, duh. But that didn t stop them from editing this video footage and then using it to claim that the women s health provider was selling baby parts. They weren t.)State Attorney General Xavier Becerra announced the charges against David Daleiden and Sandra Merritt on Tuesday. The Associated Press reports:The allegations say the pair filmed 14 people without permission between October 2013 and July 2015 in Los Angeles, San Francisco and El Dorado counties. One felony count was filed for each person. The 15th was for criminal conspiracy to invade privacy.According to Becerra, Daleiden and Merritt created a fictitious biomedical research company, which they then lied about in order to convince representatives of Planned Parenthood to meet with them   and then they secretly recorded them without their knowledge.Daleiden claims these charges are  bogus  and are only being brought against him because of Planned Parenthood s political cronies.  Naturally. The public knows the real criminals are Planned Parenthood and their business partners,  Daleiden said. (For the record, the women s health care provider has committed zero crimes.)Last April, Daleiden claimed on social media that his home had been raided by agents from the California Department of Justice who confiscated all his video footage, among other things. There had been no word on the investigation since then until the charges were filed with the San Francisco Superior Court on Tuesday.In January of 2016, Daleiden and Merritt were both indicted on similar charges by a grand jury in Texas. That grand jury had originally been convened to investigate Planned Parenthood, but not only did they find no wrongdoing on the part of the women s health care provider, they also ended up indicting the filmmakers for their bogus video. Unfortunately, these charges were dropped because the prosecutor said the jury had overstepped since this was not why they were convened.Featured image via Eric Kayne/Getty Images","label":1},"truncated_cells":[]},{"row_idx":60,"row":{"text":"Donald Trump supporters thought that when they donated to his presidential campaign, they were actually receiving  Make America Great Again  hats, books, and other merchandise actually autographed by their idol. But like so much else with Trump, this was a scam too.These items offered on his website, including signed hats and signed copies of his book  The Art of the Deal,  were heavily advertised on social media and by Trump himself. But what some buyers may not have realized is that it seems Trump didn t actually sign any of the items available for purchase on his website with his own hand. Instead, the autographs all appear to have been done by an autopen machine, a device used to automatically sign a signature.The use of an autopen machine only became evident to some after Trump won the election, when opportunists who had purchased such items off Trump s website took to eBay to re-sell what they believed would be a more valuable John Hancock.On eBay, the Trump Tribe suddenly realized that all the merchandise had been signed in the exact same identical position, impossible if he had been signing them by hand.One fan told ABC News,  You think for $183, you have to be getting the real thing. Had I known, not only would I not have bought this, but I m pretty sure no one would have. Another told the news outlet that he would like to receive a refund after shelling out money for a fake Trump autograph.Trump relies on a world in which people simply accept the snake oil he s selling and don t bother to actually verify what he s saying and compare it to reality. It s a formula that has worked for him for years and years, while he profits and walks away from businesses in collapse. And now he ll be running the country.Featured image via Flickr","label":1},"truncated_cells":[]},{"row_idx":61,"row":{"text":"WASHINGTON (Reuters) - U.S. Senate Majority Leader Mitch McConnell said on Thursday he had spoken with Myanmar s Aung San Suu Kyi and that she said she was working to get aid to the Rohingya Muslim areas in the Southeast Asian nation that were affected by violence. Suu Kyi  agreed with the need for immediate and improved access of humanitarian assistance to the region, particularly by the International Red Cross, and she conveyed that she is working toward that end,  McConnell said on the Senate floor. McConnell, whose Republicans control majorities in both houses of Congress, repeated earlier criticism of a resolution introduced in the U.S. Senate urging Suu Kyi to do more for Myanmar s ethnic minority Rohingya population, and lessening the chance that any such measure could pass. McConnell has had close ties to Suu Kyi for years. He said Suu Kyi, a Nobel prize laureate and de facto head of the government in Myanmar, also known as Burma, told him when they spoke on Wednesday that violations of human rights would need to be addressed. Attacks by Rohingya militants on security posts last month triggered an army operation that has killed more than 400 people, destroyed over 6,800 houses and sent nearly 400,000 Rohingya Muslims fleeing to Bangladesh. Suu Kyi has been a target of criticism from fellow Nobel laureates and religious leaders across the world for failing to condemn human rights abuses against the Rohingya during the military s fierce response to Rohingya militant attacks. The United Nations appealed Thursday for massive help for the nearly 400,000 who fled to Bangladesh, amid concern the number could keep rising unless Myanmar ends what critics denounce as  ethnic cleansing.  McConnell said Suu Kyi s position in the government was  exceedingly difficult  and that as a civilian, she had virtually no authority over the military. He warned that weakening her could interfere with the country s transition from decades of military rule. McConnell said he expected a briefing soon from Suu Kyi s office and that she was  trying very hard to improve conditions  for the Rohingya.  Burma s path to representative government is not at all certain and is certainly not over. And attacking the single political leader who has worked to further democracy within Burma is likely to hinder the objective over the long run,  McConnell concluded. ","label":0},"truncated_cells":[]},{"row_idx":62,"row":{"text":"If you didn t already think Donald Trump embarrassed our country at the G7 summit in Sicily, wait till you see this.Like a 12-year-old whose mommy told him he can t buy the new gold-plated, diamond-encrusted fidget spinner, Trump flipped a world leader  the bird  with an age-old  I m going to pretend to scratch my face  move that has never fooled a single person.After Italian Prime Minister Paolo Gentiloni greeted his peers with a friendly  Buongiorno,  Trump wasted no time in being a complete dick to him.Gentiloni looked at Trump like he was a petulant child with whom the adults in the room were forced to deal, then continued speaking.Recently, the Prime Minister encouraged Trump to accept more refugees fleeing violence and to devote some money to rescue efforts in the Mediterranean Sea   something that seems to have irritated Trump.Watch it happen below:Featured iamge via screengrab","label":1},"truncated_cells":[]},{"row_idx":63,"row":{"text":"WASHINGTON (Reuters) - U.S. lawmakers proposed targeted sanctions and travel restrictions on Myanmar military officials on Thursday over the treatment of the country’s Rohingya Muslim minority, one of the strongest efforts yet for Washington to intervene in the humanitarian crisis. Introduced the day before Republican Donald Trump leaves on his first trip to Asia as president, the legislation would reimpose some sanctions lifted last year as Myanmar returned to democracy. It also would bar the United States from supplying most assistance to the country’s military until perpetrators of atrocities against the Rohingya are held accountable. The measure does not target Burmese leader Aung San Suu Kyi, head of Myanmar’s civilian-led government and a Nobel peace laureate who still enjoys strong support among some U.S. officials. But congressional aides said it is intended to underscore a strong desire among many members of Congress for her to do more to help the Rohingya. The legislation is sponsored by lawmakers including the Republican Senate Armed Services Committee chairman John McCain, and Senator Ben Cardin, the top Democrat on the Senate Foreign Relations Committee. “This bill will allow Congress to strengthen the president’s hand by making it clear to Burmese officials that there will be consequences for their crimes against humanity,” Cardin said in a statement. Among other things, it re-imposes a ban on jade and rubies from Myanmar and requires a report on which individuals should be subjected to sanctions, and instructs the U.S. Treasury Department not to support international financial assistance programs that partner with enterprises owned by the Myanmar military. A companion bill is also being introduced in the House of Representatives. That measure is also bipartisan, led by Representative Eliot Engel, the top Democrat on the House Foreign Affairs Committee, and Republican Representative Steve Chabot, another foreign affairs panel member. Members of Congress have been clamoring for a strong response to the plight of the Rohingya, and the Trump administration has been weighing labeling their treatment “ethnic cleansing.”  The State Department announced on Thursday that Secretary of State Rex Tillerson would accompany Trump on his trip to Asia, and also stop in Myanmar. More than 600,000 Rohingya Muslims have fled Rakhine state in Buddhist-majority Myanmar since security forces responded to Rohingya militants’ attacks in August with a crackdown that has included reports of burnt villages and widespread killings. The United Nations has denounced it as a classic example of ethnic cleansing. ","label":0},"truncated_cells":[]},{"row_idx":64,"row":{"text":"He was such a nice boy He was just looking for a better life. Why don t we just give all of these young illegal aliens a chance to prove that they can be contributing members of society? Is anyone else getting tired of hearing how it s not fair that Americans don t want to give over 1 million people living illegally in America blanket citizenship? A man accused of killing a South Carolina high school student had been protected from deportation under the DACA program, U.S. officials confirmed to Fox News Thursday evening.Daniel De Jesus Rangel-Sherrer, 19, is accused of murder, kidnapping, and possession of a weapon during a violent crime in connection with the death of 18-year-old Diana Martinez-Gonzalez.Martinez-Gonzalez, a junior at Greenville High School, was found dead in a wooded area Oct. 4. Officials said she had been forced into the woods and shot multiple times in the head. Immediately upon contact, [Rangel-Sherrer] confessed to one of the deputies,  Greenville County Sheriff Will Lewis told reporters.Investigators said a friend of Martinez-Gonzalez was also held against her will by the suspect, but she managed to escape and contact authorities. It s not clear how Rangel-Sherrer and Martinez-Gonzalez knew each other.The day after Rangel-Sherrer s arrest, Immigration and Customs Enforcement (ICE) issued a detainer order for the suspect, who was in the U.S. illegally from Mexico. The U.S. Citizenship and Immigration Services (USCIS) later confirmed that Rangel-Sherrer was a DACA recipient.  Fox NewsWatch here to see Tucker Carlson s stunning interview with CIS s (Center for Immigration Study) Mark Krikorian, who explains what DACA really means, and how the FACTS about DACA affect every American taxpaying citizen:","label":1},"truncated_cells":[]},{"row_idx":65,"row":{"text":" ","label":1},"truncated_cells":[]},{"row_idx":66,"row":{"text":"Why a recount only in states that Trump won?Why a recount in Michigan, which is all paper ballot?@DrJillStein?https://t.co/hXRRg75qPW pic.twitter.com/xEpxFraDoi  Paul Joseph Watson (@PrisonPlanet) November 25, 2016 This election, we are not only deciding what kind of world we will have, but whether we will have a world or not going forward,  Stein warned, explaining that Clinton s trigger-happy militarism  is a mushroom cloud waiting to happen. Stein blasted Clinton s  warmongering  that  almost singlehandedly  brought us the turmoil in Libya and could lead us into a nuclear war if Clinton were elected president. Hillary brought us Libya almost singlehandedly,  Stein explained in a Thursday Fox Business interview. She continued:And she has said that she will lead the charge with a no-fly zone in Syria, and that basically amounts to a declaration of war against Russia, who is there under international law, having been invited by the sitting government. Like it or not, Russia has the sanction of international law to be there. For us to go in and declare a no-fly zone means get ready for war with Russia. Both of us have 2,000 nuclear weapons on hair trigger alert. This is the most dangerous moment  according to the former president of the Soviet Union, Mikhail Gorbachev, who, two weeks ago, said this is the most dangerous nuclear moment ever.Stein elaborated on this view during a Facebook Live interview with progressive Marc Lamont Hill, who has endorsed Stein over Clinton:  In this election, we are not only deciding what kind of world we will have, but whether we will have a world or not going forward,  Stein said, adding:Not only in regards to climate, not only in regards to these expanding wars where Hillary has this proven track record   of the most pro-conflict military policy as possible, and she s calling for a no-fly zone in Syria, which means we re essentially declaring war on Russia if Hillary gets elected declaring war on Russia at a time when we have 2,000 nuclear weapons between us and the Russians on hair trigger alert. This is a mushroom cloud waiting to happen. So it s really important right now for us to stand up and start building a force to do the right thing.Paul Joseph Watson asks another great question for Americans. Why not count the states Hillary won by a small margin?:Why is there no recount in states that Hillary won with smaller margins than Trump won PA? #AuditTheVote pic.twitter.com/qYLw7pK3dv  Paul Joseph Watson (@PrisonPlanet) November 25, 2016","label":1},"truncated_cells":[]},{"row_idx":67,"row":{"text":"NAIROBI (Reuters) - A prominent strategist for Kenya s opposition who has strongly criticized President Uhuru Kenyatta and called for some parts of the country to secede was released on Monday after being briefly detained on suspicion of inciting violence. Kenya s public prosecutor said on Twitter that David Ndii had been released on police bond and that  appropriate actions  would be taken after investigations are completed.  Police had earlier said Ndii, an economist and anti-corruption campaigner who was arrested on Sunday in the coastal town of Diani, was  under interrogation regarding ... the offence of incitement to violence . Opposition leader Raila Odinga condemned the arrest, saying on Monday:  He has committed no crime. (This is) designed to intimidate and fragment the people of Kenya.  Pro-democracy groups said Ndii s arrest raised concerns about freedom of expression.   Ndii has been at the forefront of articulating the problems with the way the country is run,  said Gladwell Otieno, executive director of Africa Centre for Open Governance (AfriCOG) in Nairobi.      Ndii is an outspoken critic of Kenyatta, who was sworn in for a second presidential term last week after a prolonged elections season that has disrupted the economy and spurred protests that killed more than 60 people.  A senior policy adviser to the opposition National Super Alliance (NASA), he has called since a disputed August election that was voided by the Supreme Court for western and coastal areas that are opposition strongholds to declare independence.   Odinga, who boycotted a repeat poll in October saying the election commission had failed to carry out sufficient reforms, has said his preference is for Kenya to remain united. Kenyatta won the re-run election with 98 percent of the vote but the country, a Western ally in a volatile region, remains deeply divided after months of bitter campaigning and sporadic violent clashes. Salim Lone, an Odinga adviser, said Ndii was helping to organize the  swearing in  of Odinga by a people s assembly on Dec. 12, Kenya s independence day, a plan that has raised the prospect of further confrontations with security forces. Ndii s wife Judith Mwende Gatabaki told journalists on Monday that he was arrested by men who identified themselves as members of the  flying squad    a police unit that is part of the criminal investigation directorate.  She said they searched the couple s hotel room before taking him away and that she had been unable to reach her husband since.     We came here to attend a wedding. There was nothing political about it and my husband is not a criminal,  Gatabaki  said.  ","label":0},"truncated_cells":[]},{"row_idx":68,"row":{"text":"I wish this was a joke!#BlackLivesMatter protesters, loot stores, stop traffic for thousands of commuters, throw molotov cocktails, rocks and bricks at innocent police officers assigned to keeping the protesters and innocent civilians safe, discriminately beat up White people well just because they re White (see video below) But if they get arrested they re asking WHITE people to bail them out? You can t make this up Here is a list of things the Black Lives Matter protesters rioters need from their Charlotte SURJ Facebook page: #CharlotteProtest Beating man begging for mercy in parking garage. @AC360 @seanhannity @BretBaier Credit:Lenard Bennett (facebook) @ncnaacp pic.twitter.com/YWHEU2UV1n  Queenie   (@LibertarianQn) September 22, 2016h/t to Allison for sharing this with 100% FED UP!","label":1},"truncated_cells":[]},{"row_idx":69,"row":{"text":" President Donald Trump continued his attack on Connecticut Sen. Richard Blumenthal Monday afternoon, once again mocking the Democratic lawmaker for past falsehoods about his service in Vietnam.Never in U.S.history has anyone lied or defrauded voters like Senator Richard Blumenthal. He told stories about his Vietnam battles and .  Donald J. Trump (@realDonaldTrump) August 7, 2017Interesting to watch Senator Richard Blumenthal of Connecticut talking about hoax Russian collusion when he was a phony Vietnam con artist!  Donald J. Trump (@realDonaldTrump) August 7, 2017 conquests, how brave he was, and it was all a lie. He cried like a baby and begged for forgiveness like a child. Now he judges collusion?  Donald J. Trump (@realDonaldTrump) August 7, 2017Trump initially criticized Blumenthal in response to his discussion of the ongoing investigation into Russian meddling in the 2016 election and its possible connections to the Trump campaign during a CNN interview Monday morning.  Daily CallerTrump didn t stop with his string of attacks on the con-man senator, Richard Blumenthal. He took to Twitter again yesterday to suggest Senator Blumenthal talk a  nice long vacation in Vietnam, where he lied about his service, so he can at least say he was there. I think Senator Blumenthal should take a nice long vacation in Vietnam, where he lied about his service, so he can at least say he was there  Donald J. Trump (@realDonaldTrump) August 7, 2017Blumenthal criticized the Trump administration s decision to triple the number of leak investigations pursued by the Department of Justice, arguing in the CNN segment that the plan represented an attempt to  weaponize  leak probes.Trump s comments allude to a 2010 New York Times report which found that Blumenthal falsely claimed he had served in Vietnam during the U.S. occupation. In truth, Blumenthal served in the U.S. Marine Corps reserve, but he never left the U.S. in the course of service. The senator later explained that he  misspoke. In case anyone was thinking (or hoping) President Trump would discontinue using Twitter as a way to keep a direct line of communication open with Americans, it s not gonna happen. Most of his supporters have become used to his bombastic style and appreciate the way in which he has chosen to connect with Americans in a more direct fashion.Just before President Trump destroyed the con-artist senator from Connecticut, he sent this tweet, where, after he shared some of his most significant accomplishments to date, he made it perfectly clear to his followers that he  Will never change! :  Supreme Court pick, economic enthusiasm, deregulation & so much more have driven the Trump base even closer together. Will never change!  Donald J. Trump (@realDonaldTrump) August 7, 2017","label":1},"truncated_cells":[]},{"row_idx":70,"row":{"text":"DUBAI/RIYADH (Reuters) - French President Emmanuel Macron held hastily scheduled talks in Riyadh on Thursday with Saudi Crown Prince Mohammed bin Salman amid rising tensions between Saudi Arabia and Iran, notably over Lebanon and Yemen. Macron, who flew in from a visit to the United Arab Emirates, had earlier declined to discuss a wave of high-level arrests for corruption in Saudi Arabia, but said it was vital to work with the kingdom for the stability of the region. The first face-to-face talks between the two men focused on regional questions, in particular Yemen and Lebanon, and  ensuring the preservation of stability in the region , the French presidency said in a statement after the meeting. Two top Lebanese government officials said on Thursday that Riyadh was holding Lebanon s Saad al-Hariri captive and a third told Reuters that the Saudi authorities had ordered Hariri to resign while he was in Riyadh last weekend, and put him under house arrest. Saudi Arabia has denied that he is under house arrest, but Hariri himself has not denied that his movements are being restricted. France has close ties with Lebanon, a former colony, and with Hariri, who has a home in France after spending several years in the country. Macron said at an earlier news conference in Dubai there had been informal contacts with Hariri, but no request to transfer him to France.   They discussed the situation in Lebanon following the resignation of Prime Minister Hariri,  the French presidency said.  President Macron reiterated the importance France attaches to Lebanon s stability, security, sovereignty and integrity.  The statement made no mention on whether Macron had spoken with or seen Hariri while in Riyadh. In recent years, France has been able to nurture new links with the Sunni-ruled Gulf Arab states due to its tough stance on Iran in nuclear negotiations, and the broad similarity of their policies on conflicts across the Middle East. However, the 32-year-old Saudi crown prince has emphasized closer ties with U.S. President Donald Trump at a time when Macron has in turn sought to improve relations with Iran, Saudi Arabia s Shi ite rival for regional influence. Macron has said he will travel to Iran in 2018, potentially becoming the first French president to travel there since 1971.  In Yemen, the Saudi-led military coalition fighting the Houthi movement said on Monday it had closed all air, land and sea ports to stem the flow of arms to the Houthis from Iran. The United Nations said the move risked causing  the largest famine the world has seen for many decades, with millions of victims . The French presidency said Macron underlined his concerns regarding the humanitarian situation. On Iran, Macron repeated earlier in Dubai that he wanted to keep the landmark 2015 nuclear deal, which Trump has challenged.  But he said he was  very concerned  by Iran s ballistic missile program, mentioning a missile fired from Yemen and intercepted by Saudi Arabia on Saturday, and raised the prospect of possible sanctions with regard to those activities.  There are extremely strong concerns about Iran. There are negotiations we need to start on Iran s ballistic missiles,  he said.  Like what was done in 2015 for the nuclear activities, it s necessary to put a framework in place for Iran s ballistic activities and open a process, with sanctions if needed, of negotiation that would enable (that).  Iran has denied providing ballistic missiles to Yemeni Houthi rebels and says its missile program is purely defensive and should not be linked to the nuclear deal. Macron reaffirmed his intention to go to Iran as part of efforts to talk to all the actors in the region, but warned about decisions that could destabilize the region further.   We need to have a truthful dialogue,  he said.  It s not about showing any naivety toward Iran, it is about standing beside our allies, in particular the United Arab Emirates, but it is also about not having a diehard policy that could create imbalances or even conflicts in the region.  ","label":0},"truncated_cells":[]},{"row_idx":71,"row":{"text":"WASHINGTON (Reuters) - President Donald Trump called on fellow Republican Roy Moore on Friday to concede to Democrat Doug Jones in the Alabama U.S. Senate race, following the party’s stinging loss in the southern U.S. state earlier this week. Moore, whose controversial candidacy was beset by allegations that he sexually assaulted or pursued teenage girls while in his 30s, has so far refused to admit defeat in Tuesday’s election that saw Jones win by 1.5 percentage points with 99 percent of the ballots counted. The embattled Republican has made two statements since his loss, but has not conceded even as Trump and others have reached out to congratulate Jones, a former prosecutor, on his win. “I would certainly say he should,” Trump, who endorsed Moore in the final stage of the campaign, told reporters at the White House.  “He tried,” Trump added, referring to Moore’s campaign efforts and reiterating his earlier comments that as the party’s top leader he would have liked to keep the seat in Republican hands.  Jones defeated the former judge in a special election to replace Jeff Sessions, who left the Senate to serve as U.S. Attorney General under Trump. State officials have said the outcome is unlikely to change even as provisional ballots are counted. The Democratic win would narrow Republicans’ hold on the Senate to 51 out of 100 seats. It has also buoyed Democrats’ hopes of a potential comeback for the party in the 2018 midterm elections.    ","label":0},"truncated_cells":[]},{"row_idx":72,"row":{"text":"WASHINGTON (Reuters) - Ten state governors seeking to avoid millions of dollars in federal healthcare cuts under Republican plans to replace Obamacare pressed their case in a meeting with Vice President Mike Pence on Sunday, according to two people briefed on the talks.     The governors are worried that repealing former President Barack Obama’s 2010 healthcare law without a detailed replacement will take coverage away from millions of Americans and land the states with a large financial hit.  Pressure from governors is just one of the challenges facing President Donald Trump’s administration as it tries to  scrap Obama’s Affordable Care Act, one of the Republican’s signature election campaign promises. During the hour-long meeting, the governors presented Pence and Health and Human Services Secretary Tom Price with a proposal to reform the Medicaid program for the poor, the sources said.  Under Obamacare, more than 30 states - including about a dozen with Republican governors - expanded Medicaid by allowing those who earned incomes up to 138 percent of the federal poverty level to enroll.   The governors’ plan would allow those states to maintain the Medicaid expansion and enable other states to also expand, according to a copy of the proposal seen by Reuters. States could choose to expand Medicaid to any income level at or below 138 percent and retain enhanced federal funding for the program. The proposal would also give states more flexibility in how they manage their Medicaid programs and cap spending for certain populations.  House Republicans have yet to agree on a single detailed policy proposal and many say it will not be in place before 2019. On Thursday, a draft Obamacare repeal bill by the House Republicans was available for Republican members of the House Energy and Commerce Committee to read in a room on Capitol Hill but was not publicly released. It was not clear whether the governors’ demands were addressed in the latest version of the draft bill.  “The President and Vice President have been very clear that governors and states will play a critical role in the repeal and replacement of Obamacare,” said Marc Lotter, a Pence spokesman.  Ohio Governor John Kasich also met with Trump on Friday and briefed him on the governors’ plan. In his address to Congress on Tuesday, Trump said that state governors should be given “the resources and flexibility they need with Medicaid to make sure no one is left out.”  Wisconsin Governor Scott Walker and House Ways and Means Committee Chairman Kevin Brady met on Thursday with Republican members of the Senate Finance Committee and discussed the Medicaid expansion. “We’re still a long ways off,” Walker said. “The same things they (lawmakers) hear from their members are the same things we hear in the states, is how do you balance states that didn’t take the expansion and states that did. How do we make sure we find a good way?” he said. ","label":0},"truncated_cells":[]},{"row_idx":73,"row":{"text":"Add this name to the list of people you ve never heard of, but are about to: Courtland Sykes.The Missouri Republican is a Navy Veteran, an impossibly good looking model-type, and a misogynist pig who s stuck in the early 1950 s. He s also running for the United States Senate in an uphill challenge against Democrat Claire McCaskill.The problem is, since he announced his run at the Senate, nobody s sat him down for an interview. He has, however, released a headshot to reporters, along with an interview-style, 11-page document that outlines some of his positions:He also addressed whether he favored women s rights, in a way that beggars belief: Chanel (Rion), my fiancee, has given me orders to favor these rights, so I d better. But Chanel knows that my obedience comes with a small price that she loves to pay anyway   I want to come home to a home-cooked dinner at six every night, one that she fixes.It s exactly the kind of family dinner that I expect one day my future daughters will learn to make after they too become traditional homemakers and family wives   think Norman Rockwell here   and Gloria Steinham be damned. Now, I m not sure if Sykes is aware of Rockwell s liberalism after he began seeing a psychotherapist for his severe depression (likely brought on by the fact that his art was hijacked by Cold War politics), but he should probably check out some of Norman s later work before he starts citing him as an influence,   la Saturday Evening Post.That headshot, though:Oh, I ve already Google reverse image-searched it. I ve been through his whole Facebook profile, and it appears to be legit. He even has pictures with his mom from when he was younger.It s not that I don t believe that Courtland Sykes is a real person. I just have a hard time believing this guy is for real.Featured image via Facebook","label":1},"truncated_cells":[]},{"row_idx":74,"row":{"text":"AROUND 70 per cent of female refugees in northern France have been the victims of rape, domestic violence or sexual abuse, the French charity Gynecology Without Borders (GSF) reports.The horror statistics were revealed yesterday by the group which used to operate at the now-demolished Jungle camp in Calais.It said many women suffered daily attacks.Richard Matis, the charity s vice president, said:  Refugee camps worldwide are plagued by violence, that is a fact. But women are usually found to be more at risk of rape and other forms of sexual assault. The charity, which now treats female migrants  stuck  in the sprawling Grande-Synthe tent camp in neighbouring Dunkirk, added the women were raped and beaten on a  daily basis,  and had become  immune  to sexual violence and abuse.Mr Matis added:  Some women were repeatedly raped during the perilous journey to Europe. Others are trapped in abusive marriages. And some women are pimped out by their husbands and forced into so-called  survival sex  with people smugglers so that their families can continue traveling across Europe. For entire story: Express UK","label":1},"truncated_cells":[]},{"row_idx":75,"row":{"text":"Charlie LeDuff is legend in Detroit but this is a classic: ","label":1},"truncated_cells":[]},{"row_idx":76,"row":{"text":"WASHINGTON (Reuters) - U.S. Treasury Secretary Steven Mnuchin said on Tuesday that if China doesn t follow the United Nations sanctions approved on North Korea, he will seek new financial sanctions on Beijing to cut off access to the U.S. financial system.  Mnuchin told a conference broadcast on CNBC that China agreed to  historic  sanctions on North Korea on Monday in a UN Security Council vote.  If China doesn t follow these sanctions, we will put additional sanctions on them and prevent them from accessing the U.S. and international dollar system, and that s quite meaningful,  Mnuchin said.    ","label":0},"truncated_cells":[]},{"row_idx":77,"row":{"text":"Democratic Sen. Chris Murphy (Conn.) said Wednesday on MSNBC s  Morning Joe  that Republican efforts to repeal Obamacare are based on the GOP s  hatred of Barack Obama. MSNBC contributor Eddie Glaude asked Murphy what he believes the  animating commitment  behind the GOP health care bill is and what it would take for him to work in a bipartisan way with Republicans to fix the country s health care system. At this point, I think it s clear the animating commitment is a hatred of Barack Obama,  Murphy said.  The policy has been pushed to the wayside here. They don t seem tremendously interested in actually crafting something that insures more people or reduces rates. They just want to fulfill this commitment that they made to repeal Obamacare. Murphy went on to say that he has made it very clear he wants to compromise with Republicans on health care. They want, as far as I can tell, flexibility of benefit design. They want something that has some cheaper premiums, less regulations in these exchanges. I m willing to talk to them about that,  Murphy said.  I m willing to give them some flexibility of benefit design if they re willing to give us some security on these exchanges that Donald Trump won t unwind them. ","label":1},"truncated_cells":[]},{"row_idx":78,"row":{"text":"Leave it to a Democrat to waste everyone s time and money by putting forth legislation she knows has no chance of passing, as a means to convince legislators they need to make it easier to kill an unborn child. A Kentucky lawmaker has put forward a bill that would require men to visit a doctor at least twice and obtain a signed permission slip from their wives before they could obtain a prescription for the erectile dysfunction drug Viagra.State Rep. Mary Lou Marzian, a Democrat, acknowledged to the Louisville Courier-Journal that the bill has no chance of passing. However, she said the bill was a response to several anti-abortion measures, including a recently ratified law that requires a woman seeking an abortion to get counseling at least 24 hours in advance from a health professional.In an opinion piece, Marzian said her bill is meant to  illustrate the absurdity of government encroachment into women s personal and medical decisions currently running amok in the Kentucky General Assembly and [Gov. Matt] Bevin administration. Marzian s bill specifies that only married men can obtain Viagra and a prospective patient must  make a sworn statement with his hand on a Bible that he will only use a prescription for a drug for erectile dysfunction when having sexual relations with his current spouse. Other state lawmakers have filed similar bills to make political points. In 2012, a bill from an Ohio state senator required men to get a psychological evaluation before getting a Viagra prescription and last year a South Carolina state representative filed a bill that would require men to wait 24 hours before getting a prescription.Marzian has also said she would file a bill requiring potential gun buyers to undergo counseling from victims of gun violence 24 hours in advance of the purchase. Via: FOX News","label":1},"truncated_cells":[]},{"row_idx":79,"row":{"text":"AUSTIN, Texas/WASHINGTON (Reuters) - U.S. Republican Representative Blake Farenthold said he would not seek re-election in November, denying allegations of sexual harassment by former staffers but admitting he allowed an unprofessional culture to flourish in his Capitol Hill office. The 55-year-old congressman from Corpus Christi, Texas, made the announcement on Thursday, a week after the House Ethics Committee said it was investigating him over allegations of sexual harassment, discrimination and retaliation involving a former female staff member. The committee said it was also looking into whether Farenthold had made inappropriate statements to other members of his staff. In a videotaped statement on his campaign’s Facebook page, Farenthold said he was a political novice unprepared for his new responsibilities when he came to Washington for his first term in 2011. “I had no idea how to run a congressional office, and as a result, I allowed a workplace culture to take root in my office that was too permissive and decidedly unprofessional,” he said. Politico reported last week that the congressional Office of Compliance had paid $84,000 from a public fund on behalf of Farenthold for a sexual harassment claim. In 2014, his former communications director, Lauren Greene, filed a lawsuit accusing him of creating a hostile work environment, gender discrimination and retaliation, court documents showed. The two reached a confidential mediated agreement in 2015, according to a statement from Farenthold’s office that denied any wrongdoing by him. Reuters has been unable to verify the allegations against Farenthold, who said on Thursday that the charges were false.  “This issue has become a political distraction,” he said. “Quite simply, my constituents deserve better.” House of Representatives Speaker Paul Ryan called the allegations disconcerting, including reports outlining “unacceptable behaviors.”  “I think he’s made the right decision to retire,” Ryan said. Congress is reviewing its workplace policies on sexual harassment after a number of lawmakers have been accused of sexual misconduct in recent weeks amid a wave of such allegations against powerful men in entertainment, politics and the media.  Last week, Democratic Representative John Conyers and Republican Representative Trent Franks resigned, while Democratic Senator Al Franken said he would be stepping down in the coming weeks. ","label":0},"truncated_cells":[]},{"row_idx":80,"row":{"text":"CINCINNATI (Reuters) - Democrat Richard Cordray delivered a campaign-style stump speech at a sprawling Labor Day celebration on Monday, but the U.S. Consumer Financial Protection Bureau chief stopped short of saying whether he intends to run for governor of Ohio. If Cordray were to step down to run for political office it would allow President Donald Trump to appoint a successor as head of the consumer watchdog agency, which has stoked the ire of Wall Street with steep penalties for misconduct and tougher rules on lending. “We need to join together to help each other rekindle the hope, the enthusiasm, and the willingness to find and make our own opportunities,” Cordray said to hundreds of union members, a key Democratic constituency, at an AFL-CIO picnic in Cincinnati. Cordray is the first director of the CFPB, a consumer watchdog agency created under former President Barack Obama in the aftermath of the 2007-2009 financial crisis. An Ohio native, he has been widely expected to jump into the race for governor and clearly appeared to be testing the political waters with his speech on Monday. Though many had speculated he would use the occasion to   announce his candidacy, activists and political leaders said any formal announcement about Cordray’s plans to enter the 2018 contest would wait until the CFPB finalizes a long-awaited rule restricting the activity of payday lenders. Current Ohio Governor John Kasich, among more than a dozen Republican candidates to be defeated by Trump in last year’s presidential primary campaign, is barred by term limits from running again in the pivotal election battleground state. As CFPB director, Cordray has rained down steep penalties on banks, auto dealers, student lenders and credit card companies for alleged predatory lending practices. His reputation as being tough on banks and sticking up for consumers has many Democrats saying he is their best hope for taking the governors mansion, and chipping away at Republicans’ dominance in state government.  Due to a law forbidding public officials from using their office to advance political campaigns, Cordray would have to resign to run for governor. His term does not expire until next summer, when Democrats will already have selected their gubernatorial nominee in primary elections. Members of both parties have said Trump would seize on a vacancy at the top of the CFPB to make good on campaign promises to slash regulations and weaken or perhaps even dismantle the agency. Republicans have long fought to take the agency apart, saying it oversteps its authority and that the single director, who both writes and enforces rules, has too much power. The agency itself has repeatedly declined to comment on Cordray resignation rumors. CFPB critics say Trump could use a 1998 law to slide in a current administration appointee, already confirmed by Congress, as temporary director if Cordray resigns. A legal ruling that Trump can fire Cordray is currently under appeal. “He’s done a great job and I don’t think he should leave for  any reason,” said Karl Frisch, executive director of the liberal group Allied Progress. ","label":0},"truncated_cells":[]},{"row_idx":81,"row":{"text":"LONDON (Reuters) - Britain could bring in tough new controls on immigration from the European Union without actually having to leave the bloc, former prime minister Tony Blair said on Sunday. Concerns over the impact of high levels of immigration on public services and housing were cited as a factor by many who voted to leave the EU in last year s referendum. Prime Minister Theresa May s Conservative government has said free movement of EU citizens coming to Britain must end. Many Brexit supporters blame Blair s government, which allowed citizens of former communist states to settle immediately in Britain despite a long transition period implemented by other EU countries, for a big influx of EU migrants from 2004.  There is no diversion possible from Brexit without addressing the grievances that gave rise to it. Paradoxically, we have to respect the referendum vote to change it,  Blair, who has said Brexit can and should be stopped, wrote in the Sunday Times newspaper.  We can curtail the things that people feel are damaging about European immigration, both by domestic policy change and by agreeing change within Europe to the freedom of movement principle,  added Blair, who led a Labour government for a decade from 1997. Asked about Blair s proposals, defense minister Michael Fallon said the government had to get on with delivering Brexit.  The country has taken its decision, we are leaving the European Union now and that means freedom of movement has to end ... there have got to be restrictions on those coming here,  he told BBC Television. A leaked government document last week said Britain was considering measures to restrict immigration for all but the highest-skilled EU workers, plans some companies called alarming. A paper published on Sunday by Blair s Institute for Global Change said the government could take steps including registering EU migrants when they arrive to keep track of whether they meet EU rules about finding work. EU migrants could also be forced to show evidence of a job offer before being allowed to enter Britain, and those without permission to reside could be banned from renting, opening a bank account or accessing welfare benefits, it said. The paper also proposes seeking an  emergency brake  to implement temporary controls on migration when services are stretched   a strengthened version of a deal offered to former Prime Minister David Cameron ahead of the referendum. ","label":0},"truncated_cells":[]},{"row_idx":82,"row":{"text":"BERLIN (Reuters) - Chancellor Angela Merkel said on Monday she wanted to conclude exploratory talks on a possible coalition with the center-left Social Democrats (SPD) by mid-January to end Germany s political deadlock. Merkel was asked if comments by her and President Emmanuel Macron that Germany and France hope to make progress on ideas to reform the euro zone by March were realistic, given the risk that talks with the SPD could falter.  I mentioned March because we want to hold exploratory talks by mid-January,  Merkel told reporters after a meeting of the executive board of her Christian Democrats (CDU). Merkel s conservative bloc, weakened in a September election that produced a splintered parliament, will hold their first meeting with the SPD on Wednesday. A deal with the SPD is Merkel s best chance of securing a fourth term as chancellor. She implied there was room for maneuver on policy, but appeared to rule out cooperation outside the framework of a formal coalition. If the exploratory talks are successful, the SPD will move on to negotiate a detailed blueprint with the CDU and its Bavarian sister party, the CSU, setting out government policy for the next four years.  The SPD agreed to enter talks only reluctantly after voters rewarded it in September for the last four years of  grand coalition  under Merkel by handing it its worst result since 1933. Some in the SPD now want to cooperate with Merkel outside of a formal coalition agreement, in the hope of better preserving a more distinct separate identity in voters  minds. But Merkel said a stable government required formal agreements on policy:  Anything short of that would mean the exploratory talks were not successful.  Should Merkel and SPD leader Martin Schulz fail to reach an agreement, President Frank-Walter Steinmeier could call a new election, something neither party wants as both fear the far-right Alternative for Germany (AfD) would make more gains. SPD General Secretary Lars Klingbeil warned Merkel on Monday that party leaders would not win the required blessing from members for renewing their alliance if the SPD gave way on key election promises. He said it would insist on distinctive leftist policies, such as introducing a single  citizen s insurance  to replace the current dual system: superior private health insurance used mainly by the wealthy, and a more widely accessible public health insurance. Conservatives say switching to a unified system would erode competition and worsen services. But Merkel said on Monday that it was possible to find common ground with the SPD on ways to improve the healthcare system. Immigration is another sticking point. The SPD opposes a conservative plan to prolong a halt to the right of some accepted asylum seekers to bring in family members. It says the measure hampers efforts to integrate the 1.6 million people who entered Germany seeking asylum in 2015 and 2016.  Integration works only with families,  Klingbeil said. The CSU, which fears losses to the AfD in an election in Bavaria next year, is likely to put up more resistance to SPD policy demands than the CDU, notably on immigration. ","label":0},"truncated_cells":[]},{"row_idx":83,"row":{"text":"Now that Donald Trump has more or less sealed the Republican nomination, Democrats see a very real possibility that he could be president and that is scaring people to death. Thanks to Trump, last minute Democratic voter registrations in California are up   way up.In the first three months of the year, California added 1.5 million new voters through the end of April   double the number of new voters added during the same time period in 2012. And the total number of registered Democrats increased by nearly 100,000 people between the beginning of January and the beginning of April   compared to a gain of just 15,000 registered Republicans, according to an analysis from Political Data Inc., a California-based voting analytics firm. What s interesting is that the upticks have been greatest among Democrats and Latinos on those days where Donald Trump is kind of dominating the conversation,  said Mitchell, a former Democratic consultant who has analyzed California voter registration from day to day and by party affiliation since January.Source: PoliticoOf course, this is bluer than blue California. Trump won t win the Golden State, but the state is heavily Latino, and that could mean a lot for the general election in November. In fact, it reflects a pattern that s been happening throughout the primaries.While Republican turnout is at an all time high, Democrats have been almost as busy:Turnout has nearly been just as intense on the Democratic side, where 11.7 percent of eligible voters have cast their ballots, the highest percentage since 1992 other than the year Barack Obama was first elected president in 2008.Several media outlets have recently reported large swaths of legal Hispanic citizens are registering to vote in swing states across the country with the express purpose of casting their ballots against the unapologetic Trump. The outspoken New York real estate magnate launched his campaign by deriding Mexican immigrants as killers and rapists. We ve seen more people this year that want to become citizens and specifically because they want to vote against Trump,  said Mi Familia Vota executive director Ben Monterroso, whose group is among those leading a nationwide effort aimed at getting more Latinos to the polls.Source: Latin PostThe Latino vote represents more than 1/6 of the entire voting populace. Latinos are also the fastest growing demographic in the country. Even before Trump called all Mexicans  rapists  or blathered on about his  big, beautiful wall,  that he would have Mexico pay for, the Republican Party has been on the losing end of the electoral sea change. The last time a Republican wont the majority of the Latino vote was in 2004, and that was George W. Bush, who spoke Span(gl)ish and said he d prioritize comprehensive immigration reform. Yes, George W. Bush was a disastrous president, but his immigration stance was still much better than Trump s.The reality is, that without the Latino vote (yes, he did win the Latino vote in Nevada, but only the very small Republican Latino vote. The vast majority of Nevada Latinos are Democrats), Trump has a very tough road ahead of him: There is no president that can get the White House without having the Latino vote,  Mr. Monterroso told the Latin Post.  You have key states that without the Latino support, the candidate is not going to win, and if those key states don t vote for the president   they re not going to make it. The data backs him up. By most political scientists  estimates, the eventual Republican nominee needs between 40 and 47 percent of the Latino vote to win in a general election.Still, there is a chance Trump could find an issue that appeals to enough Latinos that he could siphon off a few votes from the Democratic nominee. It s doubtful he ll win the Latino vote anywhere, but he doesn t have to win it. He needs about 40 percent of the Latino vote. Is that possible? Well, Romney received 23 percent in 2012 and he wasn t anywhere near as divisive. If California, and the primary so far, are any indication, things look good for the Democratic nominee, assuming the party isn t too divided.Featured image via David McNew at Getty Images. ","label":1},"truncated_cells":[]},{"row_idx":84,"row":{"text":"RIYADH (Reuters) - A Saudi-led coalition accused Yemen s Houthi militia of a  dangerous escalation  on Sunday after Saudi air defense forces intercepted a ballistic missile fired towards Riyadh. Saudi Arabia also announced financial rewards for information leading to the arrest of 40 leaders it said were responsible for  planning, implementing and supporting the Houthi terrorist group s various terrorist activities . The bounties topped out at $30 million for the armed group s leader, Abdel-Malek al-Houthi, the state news agency reported. The missile was brought down on Saturday evening near King Khaled International Airport on the northern outskirts of the capital and did not cause any casualties.      The Houthis  dangerous escalation came because of Iranian support,  coalition spokesman Colonel Turki al-Maliki said in a televised news conference. Rocket launch vehicles used to fire the missile were made in Iran, he added. Saudi Arabia and its allies accuse arch-foe Iran of supplying missiles and other weapons to the Houthis, saying the arms were not present in Yemen before the conflict began in 2015. Iran denies the charges and blames the conflict on Riyadh. Yemen s civil war pits the internationally recognized government, backed by Saudi Arabia and its allies, against the Houthis and forces loyal to former president Ali Abdullah Saleh. The war has already killed more than 10,000 and displaced millions, with around 500,000 cholera cases reported in the country since the worst outbreak in decades started in April. The Saudi-led coalition s statement on Sunday echoed accusations by U.S. President Donald Trump, who described the missile as  a shot just taken by Iran  against Saudi Arabia. The head of Iran s Revolutionary Guard Corps dismissed Trump s comments as slander. French Foreign Minister Jean-Yves Le Drian said on Sunday the missile launch by Houthi rebels showed there was a danger of ballistic proliferation across the region. Saudi Arabia has signaled its intention to buy separate air defense systems from the United States and Russia. ","label":0},"truncated_cells":[]},{"row_idx":85,"row":{"text":"WASHINGTON (Reuters) - President Donald Trump met with key business leaders on Monday and signed an executive order withdrawing the United States from the Trans-Pacific Partnership trade deal, moving the country toward an era of bilateral trade and job creation at home, the White House said. White House spokesman Sean Spicer told a news briefing that Trump would move away from multilateral trade policies toward bilateral trade that puts America first. He said the meeting with top U.S. business leaders included a “really great” exchange of ideas and the group would reconvene again in a month. ","label":0},"truncated_cells":[]},{"row_idx":86,"row":{"text":"WASHINGTON/TOKYO (Reuters) - Barack Obama will become the first U.S. president to visit Hiroshima in Japan later this month, but he will not apologize for the United States’ dropping of an atomic bomb on the city at the end of World War Two, the White House said on Tuesday. Awarded the Nobel Peace Prize early in his presidency in 2009 in part for making nuclear nonproliferation a centerpiece of his agenda, Obama on May 27 will tour the site of the world’s first nuclear bombing with Japan’s Prime Minister Shinzo Abe.  With the end of his last term in office approaching in January, Obama will “highlight his continued commitment to pursuing the peace and security of a world without nuclear weapons,” the White House said in a statement. “He will not revisit the decision to use the atomic bomb at the end of World War II. Instead, he will offer a forward-looking vision focused on our shared future,” Ben Rhodes, Obama’s deputy national security adviser, wrote in a separate blog. The visit comes as part of a May 21-28 swing through Asia, which will include a Group of Seven summit in Japan and his first trip to Vietnam. The Asia trip seeks to reinforce his geopolitical “pivot” toward the region, though friends and allies there have sometimes questioned Washington’s commitment. The Hiroshima tour will symbolize a new level of reconciliation between former wartime enemies who are now close allies. It will also underscore Obama’s efforts to improve U.S.-Japan ties, marked by an Asia-Pacific trade pact as well as cooperation against China’s pursuit of maritime claims and the nuclear threat from North Korea. On the final day of the summit in Japan, Obama and Abe will visit the Hiroshima Peace Memorial Park near the spot where a U.S. warplane dropped an atomic bomb 71 years ago. The decision to go to Hiroshima was hotly debated within the White House. There were concerns a U.S. presidential visit would be heavily criticized in the United States if it were seen as an apology. The bomb dropped on Aug. 6, 1945 killed thousands of people instantly and about 140,000 by the end of that year. Another was dropped on Nagasaki on Aug. 9, and Japan surrendered six days later. The majority of Americans view the bombing of Hiroshima and Nagasaki as justified to end the war and save U.S lives. Most Japanese see it as unjustified. Obama’s press secretary Josh Earnest said it was “an entirely legitimate line of inquiry for historians” when asked why the White House had decided not to use his Hiroshima visit to issue an apology. He told reporters that while Obama understands the United States “bears a special responsibility” as the only country to use nuclear weapons in wartime, the president will emphasize Washington’s responsibility “to lead the world in an effort to eliminate them.” Abe, speaking to reporters in Tokyo, said he hoped “to turn this into an opportunity for the U.S. and Japan to together pay tribute to the memories of the victims” of the nuclear bombing.  “President Obama visiting Hiroshima and expressing toward the world the reality of the impact of nuclear radiation will contribute greatly to establishing a world without nuclear arms,” Abe added. Obama’s visit will be a symbolic capstone for the nuclear disarmament agenda he laid out in a landmark speech in Prague in 2009. His aides tout last year’s Iran nuclear deal as a major piece of his foreign policy legacy. But Obama has made only modest progress toward securing the world’s loose nuclear materials, and there is no guarantee his White House successor will keep the issue a high priority. Lisbeth Gronlund, co-director of the Union of Concerned Scientists’ Global Security Program, said Obama must “do more  than give another beautiful speech” and should announce concrete action on nuclear disarmament when he visits Hiroshima. After U.S. Secretary of State John Kerry visited Hiroshima last month, survivors of the bombing and other residents said that if Obama visits, they hope for progress in ridding the world of nuclear weapons, rather than an apology. ","label":0},"truncated_cells":[]},{"row_idx":87,"row":{"text":"MANILA (Reuters) - Philippine troops rescued a catholic priest held hostage for almost four months by Islamic State-linked rebels after an offensive that captured a stronghold of the militants in southern Marawi City, defense officials said on Monday. Marawi s vicar-general Father Teresito  Chito  Soganub was kidnapped along with other Christians as militants rampaged through the city on May 23, burning churches and schools, releasing prisoners and seizing arms in a well-planned assault. Soganub, flanked by Defence Secretary Delfin Lorenzana and military chief General Eduardo Ano, appeared to be in good health and high spirits when he was presented to the media in Manila. He expressed his thanks but gave no statement.  Our troops gained the upper hand, the terrorists were forced to withdraw to nearby structures on the periphery of the mosque,  Lorenzana told a media briefing in Manila, referring to the Bato mosque held by the rebels for 117 days.  Troops had opportunity to snatch Father Chito...  The appearance of Soganub is some rare good news for a military that has suffered a string of setbacks in Marawi, from deadly accidents during a controversial campaign of air strikes to repeatedly missing deadlines on when the battle would be won. The siege of the city by an alliance of rebels from the island of Mindanao, and numerous foreign fighters, has been the biggest internal security crisis in years for the Philippines, a country used to separatist and communist rebellions. Soganub made an appearance under duress in a militant propaganda video about a week after his capture, urging the government to stop the military operation in Marawi in exchange for sparing lives of hostages. The priest was among scores held by militants at the Bato mosque, one of Marawi s largest, which troops captured on Saturday afternoon. He was rescued along with another hostage, Lordvin Ocopio. The rebels who laid siege to Marawi are from an extremist faction of the Abu Sayyaf group, led by Isnilon Hapilon, the so-called  emir  of  Southeast Asia, and members of the militant Maute family, which has deep clan connections in the lakeside town and surrounding areas.   Military chief Ano said about 10 foreigners were still in the battle among some 50-60 rebels, who were holding 45-50 hostages.  Hapilon was among those still fighting but several of the Maute brothers were likely dead, Ano added, citing information provided by civilians who escaped and some captured rebels.  As of Monday, 149 members of government forces had died in combat, along with 47 civilians. More than 670 militants have been killed, according to a military estimate of bodies recovered and targets hit. ","label":0},"truncated_cells":[]},{"row_idx":88,"row":{"text":"Here we go again! What in the world is wrong with this woman? Is it her age or something like cocktails before dinner? Wonder how much they paid her for that hot mess!PELOSI HAS HAD HER SHARE OF RANTS LATELY   HERE ARE A FEW OF THE LATEST: ATTACKS TRUMP ON THE BORDER WALL:House Minority Leader Nancy Pelosi was on Meet the Press and let out another gibberish laden response to a question. Does anyone out there understand what she meant by her comments about the wall. How does it mean Trump is weak if he wants a wall? Twisted reasoning is all that comes from Pelosi these days especially when in 2006 most prominent Democrats voted to build a barrier at the border. Immoral and unwise ? How is it immoral and unwise to want to protect your people? You have to understand this part of the country. There s a community going through it. ATTACKS IVANKA TRUMP:House Minority Leader Nancy Pelosi (D., Calif.) implied during a Wednesday press conference that President Donald Trump s daughter, Ivanka Trump, has been  complicit  in her father s actions, which the lawmaker described as  not acting in the interest of the American people. https://www.youtube.com/watch?v=GUL3-iB5_pM","label":1},"truncated_cells":[]},{"row_idx":89,"row":{"text":"Via: TMZ","label":1},"truncated_cells":[]},{"row_idx":90,"row":{"text":"The Harvard study below will blow your mind! If you had any doubt Trump is being sabotaged by the main stream media and Washington old guards, look no further Coverage of President Trump is 93% negative! This is over the top! Our media and politicians are doing everything they can to destroy Trump How negative was press coverage of President Trump s first 100 days in office? Far more than that of Barack Obama, George W. Bush, or Bill Clinton, according to a new report from the Harvard Kennedy School s Shorenstein Center on Media, Politics and Public Policy.The Harvard scholars analyzed the New York Times, Wall Street Journal, Washington Post and the main newscasts (not talk shows) of CBS, CNN, Fox and NBC during Trump s initial time in office. They found, to no one s surprise, that Trump absolutely dominated news coverage in the first 100 days. And then they found that news coverage was solidly negative   80 percent negative among those outlets studied, versus 20 percent positive.The numbers for previous presidents: Barack Obama, 41 percent negative, 59 percent positive; George W. Bush, 57 percent negative, 43 percent positive; and Bill Clinton, 60 percent negative, 40 percent positive.Accusations of bias aside, it s simply a fact that a number of negative things happened in Trump s opening 100 days. The Russia investigation, for example, was a source of endless criticism from Democrats and other Trump opponents. The travel ban executive order led to intense argument and losses for the administration in the courts. The healthcare debacle created more negative coverage because it was a major screwup and a setback for both Trump and House Republicans.That said, the coverage of some news organizations was so negative, according to the Harvard study, that it seems hard to argue that the coverage was anywhere near a neutral presentation of facts. Assessing the tone of news coverage, the Harvard researchers found that CNN s Trump coverage was 93 percent negative, and seven percent positive. The researchers found the same numbers for NBC.Obama and Hillary s hero had this to say about taking down an enemy:Obama Campaign Manager and Senior Adviser had this to say about Trump last June: IT IS NOT ENOUGH TO SIMPLY BEAT TRUMP. HE MUST BE DESTROYED THOROUGHLY. HIS KIND MUST NOT RISE AGAIN. Read more: WE","label":1},"truncated_cells":[]},{"row_idx":91,"row":{"text":"If there is anything that really gets under Donald Trump s skin, it is people questioning his authority and his legitimacy as president. This is the reason that he keeps making up claims of fake voter fraud whenever anyone points out the fact that Hillary Clinton won the popular vote by close to three million. It is also why he took such exception to Saturday Night Live portraying his chief strategist, former Breitbart News head Stephen K. Bannon, as the real president.Well, that narrative has been taken to a whole other level by #RESISTANCE organizers. They, like anyone sane, realizes that Bannon has an unusual amount of power in the Trump White House. That is troubling, considering that Bannon is a white supremacist who also has said he wants to  destroy the state.  Therefore, the answer to this is to make sure that people understand that it is quite possibly Bannon, rather than Trump, calling the real shots up there in Washington.The new campaign has put signs in major cities around the nation that read,  Impeach President Bannon. Spotted in DC this morning   these are so newly posted the wheat paste is still wet. pic.twitter.com/pwTubJVFmu  Garance Franke-Ruta (@thegarance) February 19, 2017According to the people who organized the effort, their reasoning for doing so is the following: No one voted for Steve Bannon. Yet he is the de-facto 45th President of the United States. This could very well be true; after all, Trump has named Bannon to the National Security Council, all the while demoting the head of the Joint Chiefs of Staff and the Director of National Intelligence. Further, it is pretty clear to anyone watching that Bannon has quite a bit of influence over Trump   so much so that TIME Magazine actually put Bannon on the cover instead of Trump, and called him  the great manipulator. As for the goals of this campaign? Well, there are a few possibilities, according to those behind it: Maybe we ll encourage an angry tweet or two. Maybe even get Trump to say his two favorite words to Bannon,  You re Fired.  We ll tune in. It ll be great for ratings. Hopefully, Trump s ego takes over on this one, and Bannon is out the door sooner rather than later. That would definitely be a win for #THERESISTANCE.Featured image via Drew Angerer/Getty Images","label":1},"truncated_cells":[]},{"row_idx":92,"row":{"text":"Hello America Are we awake yet?AUSTIN, Texas   Texas Sheriffs, the Lieutenant Governor, and experts in immigration related issues met at the State Capitol on Wednesday to discuss the federal government s creation of a sanctuary state for criminal aliens through its Priority Enforcement Program (PEP).Jackson County Sheriff Aj (Andy) Louderback, immediate past president of the Sheriff s Association of Texas, told Breitbart Texas that the federal government s PEP program  has created a sanctuary state for criminal aliens because it has gutted the immigration system. A press conference was held on the crisis facing Texas that was created by the new immigration policies of the federal government. The sheriffs complained that aliens are being brought into the criminal justice system in Texas but are being released into the community because of the federal policies.In the past, ICE (Immigration and Customs Enforcement) could place a 48-hour hold on illegal immigrants when they were wanted on immigration related issues. The PEP program replaced the U.S. Department of Homeland Security s (DHS) Secure Communities plan and now that is no longer possible.The policy was released by Department of Homeland Security Secretary Jeh Johnson in November, 2014. In January, the program went into effect and Breitbart Texas Managing Director Brandon Darby exclusively reported leaked training documents detailing how the program would be implemented. Darby dubbed the program,  Catch and Release 2.0. Breitbart Texas has reported many examples of criminal illegal aliens who have been previously deported many times only to come back and commit even more serious crimes.In July, Breitbart California s Michelle Moons reported on the murder of Katheryn Steinle. She was killed by an illegal alien who was released by the San Francisco sheriff despite an ICE detainer in effect. Her killer had been deported several times.The same week as Steinle s murder, Darby reported on the murder in Laredo, Texas, of a woman who was killed by her criminal illegal alien husband. He had been deported four times. Despite numerous domestic violence calls to the Laredo Police Department, he was allowed to remain in Laredo until he finally killed her.There have been many other such reports in the past month about violent criminal illegal aliens who commit more heinous crimes after returning from being deported.The lieutenant governor, Texas sheriffs, and the director of policy studies for the Center for Immigration Studies spoke at the press conference in Austin, Texas. Their message   the federal government has placed the public in danger through its policies, and these policies have essentially tied the hands of Texas law enforcement.Lt. Gov. Dan Patrick (speaking) joined Sheriff Aj Louderback; Chambers County Sheriff Brian Hawthorne; Victoria County Sheriff Michael O Conner, and Jessica Vaughan, Director of Policy Studies for the Center for Immigration Studies. (Photo: Breitbart Texas/Lana Shadwick)Sheriff Louderback told Breitbart Texas,  This federal program (PEP) replaced a Congress-mandated program and replaced it with a program that now prioritizes criminal behavior and is excluding thousands of criminal aliens.  He says the program is forcing Texas sheriffs to sometimes release even violent offenders.Louderback said that criminal aliens know that law enforcement officials in Texas have their hands tied because of these new federal policies. They know they can come into the country illegally and stay here with impunity.He said illegal aliens cannot be held until after there is a final conviction. He said,  These criminals bond out and disappear into the country. These policies, say the immediate past sheriff s association president,  mean that local jurisdictions have to deal with the costs. Victoria County Sheriff Michael O Connor said criminal aliens are traversing over the border and coming in throughout the country. He said that the sheriffs intend to  connect, communicate, and collaborate with community stakeholders  to deal with the problem.Victoria County, Texas, is located about halfway between Houston and the Mexico/Texas border. He said his county is a  fatal tunnel between Harris County and the rest of the U.S. Sheriff Hawthorne told Breitbart Texas,  This is about a secure community program.  He said in 2008, law enforcement were able to do that. He said,  PEP is, and will be, a failure by this [federal] administration. Lt. Gov. Patrick promised that the senate would pass legislation to deal with the problems of sanctuary cities in the next legislative session. He said that he was confident that the senate now has the votes to deal with this issue. Sanctuary cities legislation was a contentious topic in the senate this past session.Via: Breitbart News","label":1},"truncated_cells":[]},{"row_idx":93,"row":{"text":"Out of all the insane people who are part of Trump s posse, former campaign manager Roger Stone has to win the loony prize. Stone regularly immerses himself with full-on white supremacists. During the presidential campaign, Stone was so insane that he (was forced to) quit because of all the controversy surrounding him. Apparently, he didn t want to upstage the candidate s own controversies. Now he says he has been poisoned because he knows too much about Russia, only it s not Russia, he says, that s doing the poisoning.On Tuesday, Stone appeared on conspiracy nut Alex Jones  InfoWars claiming that he had been poisoned with polonium, which is Putin and the Russian s poison of choice. However, Stone is making the claim that it was Congress (or something) that poisoned him. I became extremely ill. This manifested itself in over 14 days of high fever, delirium, night sweats, I had lesions on my chest and my face,  Stone explained to Jones.  The general consensus is I was poisoned. I was poisoned with polonium or a substance that has the characteristics of polonium and this made me exceedingly ill.  Stone s theory is that someone poisoned him because he has proof that Russia was not behind the hacks of the Democratic National Committee and John Podesta,  This is about stopping the Trump agenda,  he said.  I would blow the whistle on this whole bogus Russian narrative that they just won t let go of. Source: MediaiteHere s the insane video:He also tweeted about it:Yes, I believe I was poisoned to stop me from exposing the  Russian Hacking  LIE b4 the Congressional Investigation @StoneColdTruth  Roger Stone (@RogerJStoneJr) January 17, 2017Yes, Doctors say I was poisoned   WHO would do such a thing ? https://t.co/6o4hHgAJ2e  Roger Stone (@RogerJStoneJr) January 18, 2017While this story sounds like a bad Tom Clancy novel, it makes zero sense since people knew of Russia s involvement long before the election and if there was some vast anti-Trump, anti-Russia conspiracy theory, it would have come to fruition before Trump won the Electoral College, not after. The far more believable explanation is that Stone, who nobody really gives a crap about, wasn t poisoned and that he s trying to hawk his new book.Featured image via Spencer Platt/Getty Images","label":1},"truncated_cells":[]},{"row_idx":94,"row":{"text":"As his presidency drew to a close, Barack Obama s top aides routinely reviewed intelligence reports gleaned from the National Security Agency s incidental intercepts of Americans abroad, taking advantage of rules their boss relaxed starting in 2011 to help the government better fight terrorism, espionage by foreign enemies and hacking threats, Circa has learned.Dozens of times in 2016, those intelligence reports identified Americans who were directly intercepted talking to foreign sources or were the subject of conversations between two or more monitored foreign figures. Sometimes the Americans  names were officially unmasked; other times they were so specifically described in the reports that their identities were readily discernible. Among those cleared to request and consume unmasked NSA-based intelligence reports about U.S. citizens were Obama s national security adviser Susan Rice, his CIA Director John Brennan and then-Attorney General Loretta Lynch.Some intercepted communications from November to January involved Trump transition figures or foreign figures  perceptions of the incoming president and his administration. Intercepts involving congressional figures also have been unmasked occasionally for some time.Read more: Circa","label":1},"truncated_cells":[]},{"row_idx":95,"row":{"text":"On Friday, Florida Governor Rick Scott screwed tens of thousands of women across his state.The vile excuse for a governor signed a bill into law that will not just cut state funding for abortions (which is already prohibited on both the state and federal level), but it also cuts funding from clinics that perform abortions. The Florida Times-Union reported:The bill, which passed largely along party lines, restricts state agencies, local governments and Medicaid managed-care plans from contracting with organizations that own, operate or are affiliated with clinics that perform elective abortions. Duval County is one of the health departments with a Planned Parenthood contract that may be affected by that provision.Basically, in his quest to destroy Planned Parenthood, he is hurting any woman who goes to these clinics for free pregnancy tests, cancer screenings, free birth control, STI screenings and a plethora of other services they provide. The laws requirements that doctors who perform abortion service have patient-transfer agreements with local hospitals or admitting privileges at a hospital in the area. It mirrors an Alabama law that was struck down on Friday by Federal District Court Judge Myron H. Thompson who said the law  unconstitutionally restricts the rights of women. Planned Parenthood s president, Cecile Richards, expressed outrage over the bill: As a result of this bill, thousands of people across Florida may no longer be able to access essential reproductive health care, such as cancer screenings, birth control, and well-woman exams. This cruel bill is designed to rip health care away from those most at risk. Rick Scott is just the most recent in a very long line of Republicans who are attacking women around the country. They pretend that they are  pro-life  and that they care about women, but none of this is true. The GOP isn t  pro-life,  they are pro-fetus, anti-women asshats who don t care about the sanctity of life any more than we care about they care about the thousands of veterans living on the streets. If they were actually pro-life they would wholeheartedly support social safety nets, birth control and oppose the death penalty. But they don t, which makes the real reasons for these types of bills very obvious: they want to punish women for having sex.Featured image via Joe Raedle/Getty Images","label":1},"truncated_cells":[]},{"row_idx":96,"row":{"text":"VATICAN CITY (Reuters) - Pope Francis welcomed the poor, homeless and unemployed as guests of honor for a Mass and gourmet meal in the Vatican on Sunday, saying that helping the needy was one way of obtaining a  passport to paradise . Francis celebrated a Mass marking the Roman Catholic Church s first yearly World Day of the Poor, which the pope established to draw the attention of the world s 1.2 billion Catholics to the neediest. Volunteers from charity organizations brought about 7,000 needy people to St Peter s Basilica for a special Mass celebrated by the pope, who has made defense of the poor, immigrants and downtrodden a major plank of his papacy. About 1,500 of them were having lunch with the pope in the Vatican s large audience hall and others were being taken to eat as guests in nearby pontifical colleges. Most of the needy people were from Rome and other parts of Italy but charity groups also brought groups from France, Spain, Germany and Poland.  If in the eyes of the world they (the poor) have little value, they are the ones who open to us the way to heaven; they are our  passport to paradise . For us it is an evangelical duty to care for them ...,  he said in his homily.  God will not ask us if we felt righteous indignation, but whether we did some good,  he said, labeling indifference as a sin of omission. The pope said this  is when we say,  that doesn t concern me; it s not my business, it s society s problem.   It is when we turn away from a brother or sister in need, when we change channels as soon as a disturbing question comes up, when we grow indignant at evil but do nothing about it.  The menu for the poor was selected by Sergio Dussin, the same chef who prepares meals for visiting dignitaries at Vatican conferences. It consisted of dishes the poor can only dream of: mini gnocchi, fish with tomatoes, olives, Venetian cheese, veal with vegetables and Venetian-style tiramisu for dessert. Three days after his election in 2013, Francis said:  Oh, how I would like a poor Church, and for the poor.  He since given up some of the trappings of the papacy, shunning the spacious papal apartments in the Vatican s Apostolic Palace for a modest residence in a guest house.  He also has put aside the papal limousine and is driven around Rome in a simple blue Ford Focus. ","label":0},"truncated_cells":[]},{"row_idx":97,"row":{"text":"The media CHEERED when Democrat Senator Chuck Schumer (D-NY) helped a 24-yr old Muslim man enter the U.S. after he was denied entry The media was strangely SILENT, however, after he molested a 12-yr-old upstate NY girl while she was with her family at an event celebrating the Muslim athlete. Yesterday, it was discovered that the Islamic extremist who killed 9 people and injured dozens of others, when he rammed his truck into them on a busy bike path in New York City, entered our country on a  Diversity visa  that was the brainchild of none other than the Democrat Senator from NY, Chuck (I always put diversity before our nation s security) Schumer An Indian athlete who overcame a visa denial with the help of U.S. lawmakers and a local mayor to attend the World Snowshoe Championship in New York has been arrested on charges of the abuse of a minor.It was a long journey for Indian snowshoe champion Hussain and his coach to the World Snowshoe Championships in Saranac Lake, New York last weekend.The pair were initially denied visas to travel to the U.S. in the chaotic days following the Trump administration s travel ban, but with the help of Saranac s mayor and   according to Mir   the office of Democratic Sen. Chuck Schemer, the American Embassy in New Delhi reversed their decision Feb. 17 and allowed them to travel to the competition.Democrat Senator Chuck Schumer, an outspoken opponent of President Trump s attempts to more carefully vet refugees and visa holder s coming into the United States, bragged about getting around Trump s temporary travel restrictions on his Facebook page:Hussain hails from the Indian side of the disputed Himalayan region of Kashmir, which is predominantly Muslim. Although India is not one of the seven countries that were part of the initial travel ban, Hussain and Khan had alleged they were victims of it when their first attempt at procuring visas to travel to the United States was turned down in late January, the first business day after Trump s travel ban was put in place.Khan told the BBC that an employee at the U.S. Embassy in New Delhi told them they were being rejected because of  current policy. U.S. officials said at the time that the denial was not connected to the travel ban. An embassy spokesman said they were preparing a statement for release later in the day.  National PostThe reckless and irresponsible acts of Democrat legislators like Senator Chuck Schumer, perfectly illustrates why Trump was right about demanding that we put additional vetting measures in place for immigrants. Hussain and team manager Abid Khan arrived Feb. 23 in the bucolic Adirondacks town, which had been following their visa ordeal and extended them a hero s welcome. Locals offered congratulations and free lodgings at an inn that in the snow looked like a  fairy tale scene from a movie,  Khan said in a Facebook post.The  fairy tale  was shattered Wednesday, when Hussain, 24, was arrested and charged with felony sexual abuse and child welfare endangerment, police said.The parents of the 12-year-old girl allegedly involved said the incident happened Monday, after the end of the three-day snowshoe competition, and reported it to local authorities.Chief Charles A. Potthast Jr. of the Saranac Lake Village police force said the girl was playing pool Monday afternoon with other young people at the inn where Hussain was staying. There was a moment when the two were alone, and that s when the incident occurred,  Potthast said. The girl told police there was a  passionate kiss  and that Hussain touched her in an intimate area on top of her clothing.Hussain remains jailed on $10,000 bond. Khan said the athlete told him he had done nothing wrong.A spokesman for Schumer said the senator helped with the visa process at the request of Saranac Lake and described the charges against Hussain as  extremely troubling. A spokesman for Gillibrand said the senator thinks the charges are  extremely serious. During their time in Saranac Lake, Hussein and his coach were honored with a special reception by the mayor and gave a talk about Kashmir at Saranac Lake Middle School, where students had waged a letter-writing campaign on their behalf.  Pack your bags. Next year you are coming to Kashmir,  Hussain told them, according to one of Khan s Facebook posts. Washington PostThe athlete s coach said he is innocent. Mir had said that the visa would not have been issued without the  personal efforts  of Schumer and New York s other Democratic senator, Kirsten Gillibrand. On Saturday, Schumer celebrated Hussain s  rock star  welcome in a Facebook post, saying that the United States is  still a country that welcome athletes from across the globe to compete in our stadiums, our snow-covered fields and everywhere in between.   National Post ","label":1},"truncated_cells":[]},{"row_idx":98,"row":{"text":"Every major party presidential candidate in the last 40 years has released his or her tax returns, except for two. One was Gerald Ford and the other was Donald Trump. Trump, who s completely embroiled in a scandal surrounding ties to Russia, may soon be forced, at court or congressional order, to release his returns, but if that doesn t happen, Democrats at the state level might be forcing Trump s hand.State legislatures are now proposing measures that would ban any candidates from their ballots who don t release tax returns. Tax return information would provide some transparency there to give voters the assurance that they need that the president is acting on behalf of us,  said Kathleen Clyde, an Ohio state representative who recently introduced a version of the bill.  It is problematic that he is the only candidate in 30 or 40 years not to provide that information. Clyde s bill, the Tax Returns Uniformly Made Public Act   the TRUMP Act   would require candidates for president and vice president to disclose five years of tax documents to Ohio s Secretary of State, who would then post the documents online. Only after a candidate disclosed the tax information would he or she qualify for the ballot in one of the nation s most hotly contested battlegrounds.Similar measures requiring candidates to file with Secretary of State offices have been introduced in California, Oregon and Tennessee. Candidates would be required to file tax documents with state boards of election under bills filed in Illinois, Maryland, New York and Rhode Island.Source: The HillSo far, 19 states are considering similar bills and not all of them are blue, but it s probably that only blue states will pass the bills, if at all.Elections, even national elections, are run by the states. Nationally, there are only two qualifications to run for President: The candidate must be at least 35-years-old and must be a natural born citizen. None of the rest matters in the eyes of the law. That s why Trump didn t have to release his tax returns to begin with.However, states have more latitude. For example, in many states, candidates must receive a minimum number of signatures on a petition before being allowed on a ballot, although that typically applies to non-major party candidates. Still, states can impose rules like filing fees and deadlines, although it s still not clear that forcing candidates to release tax returns will pass constitutional muster.Even if this passes in a few states, Trump could still, if he doesn t implode, win reelection if he wins enough red states. In theory, he could win without a single vote in our most populous state (California), as long as he won the Electoral College. Let s hope these bills do pass to prevent a future Trump, but first, let s pressure Congress to force Trump s hand right now.Featured image via Pool/Getty Images","label":1},"truncated_cells":[]},{"row_idx":99,"row":{"text":"Imam Tawhidi is an outspoken voice in the Muslim community, who is unafraid to openly condemn Islamic extremists. After the terror attack today on the streets of New York City by a radical Muslim who was allegedly here on a  diversity visa , Imam Tawidi took off the gloves on Twitter and told the world that he warned Mayor DeBlasio, but was  Ignored! Tawhidi regularly tweets about the evils of extreme Islam:Extremists cannot force us into their paradise. In fact, I don t want to be in paradise if they re going to be there as well.  Imam Tawhidi (@Imamofpeace) October 31, 2017The Australian Imam is young, well presented and articulate. He is charming, has successfully utilized social media and has a strong following amongst the Australian public. Perhaps most importantly to a government that yearns for unity amongst its electorate, Tawhidi is an immigrant who champions the integration of fellow expats into the Australian community. The complete package, as it were.He isn t shy about calling out Islamic extremists and the people who suffer under Islamic extremist rule. Yesterday, Imam Tawhidi tweeted about his friend who was beaten to death by the Basij Militia of Iran over his anti-terrorist views:My friend Ali Yazdanshenas has passed away yesterday after being beaten to death by the Basij militia of Iran for his anti-terrorist views. pic.twitter.com/E04FJFcPyX  Imam Tawhidi (@Imamofpeace) October 30, 2017However, there is a barrier preventing Australian elites from supporting this maverick cleric, and that is that he does not follow the liberal narrative. Instead of simply condemning obscene teachings associated with his religion, Tawhidi demands modification. Rather than apologize for shortcomings within the immigrant community, the Imam has called for immediate action, encouraging a ban on Islamic schools and Islamist organizations like Hizb ut Tahrir. Through this, Tawhidi has even received the endorsement of none other than Ayaan Hirsi Ali   perhaps the most famous anti-Islamist (and Islamic) activist in the world   who has suggested that Tawhidi should be  elevated  to sit amongst and give counsel to politicians and leaders.Tawhidi is, therefore, one of those rare public figures: a reformer who not only denounces elements of Islam but actually seeks to restructure its teachings and interpretations. However, in the current global environment, the courage to promote such ideas inevitably leads to danger; the threat of violence is so present that Tawhidi has been forced to implement constant security measures in both his professional and private life.  The Spectator One might believe that a courageous person like Imam Tawhidi would be a valuable ally to America in their efforts to defeat radical Islam in the United States.  Based on the Imam s tweets, following the terror attack by a  diversity visa  holder in NYC, it appears that Mayor DeBlasio didn t find his warnings to be useful.Imam Tawhidi claims he personally sent letters to Mayor DeBlasio, and that he  did nothing. About #NYC terrorist attack, I personally sent letters to Mayor De Blasio online & in person about terrorist breeding in NYC.He did nothing.  Imam Tawhidi (@Imamofpeace) October 31, 2017Tawidi then tweeted that after warning DeBlasio about  hot radical centers  in NYC, he was  Ignored! In 2016, I told Mayor De Blasio that I was in NYC and noticed some hot radical centres. I was willing to point out serious cases. Ignored!  Imam Tawhidi (@Imamofpeace) October 31, 2017Imam Tawhidi explained that he s not some crackpot Imam trying to get attention, he actually holds a certificate in counter-terrorism.Not only am I a Muslim Imam who understands the threat of Islamic Extremism, I also hold a certificate in counter-terrorism. Now what!?  Imam Tawhidi (@Imamofpeace) October 31, 2017Tawhidi really blasted DeBlasio and all of the wasted energy he expends on trying to bring down President Trump and not Islamic Extremists.Fact: In the last two years, De Blasio spent all his energy and resources in trying to bring down President Trump and not Islamic Extremists  Imam Tawhidi (@Imamofpeace) October 31, 2017Imam Tawhidi went on to slam the Mayor DeBlasio of NYC and Mayor Sadiq Kahn of London who offered NYC his condolences after the terror attack:London stands in grief and solidarity with the great city of New York tonight. pic.twitter.com/ojrxSDnZos  Sadiq Khan (@SadiqKhan) October 31, 2017Here is Tawhidi s reply:De Blasio griefs about London and you grief about NYC. How about you both swap positions since you don t really care about your own people!? https://t.co/0yqTprAbdw  Imam Tawhidi (@Imamofpeace) October 31, 2017Spectator   It was during this overseas study, in 2014, that Tawhidi saw it as his duty to speak out against the questionable elements enshrined in his religion. On a sunny day in the Iraqi city of Karbala, Tawhidi was standing outside a mosque when, within earshot, a bomb exploded. As crowds ran from the scene and emergency crews rushed to help the survivors, the speakers of the mosque announced to the street below that Islamic State forces had invaded Mosul. If ever there was a time to speak out against Islamist terrorism, it was then.However, Tawhidi s campaigning has attracted many critics within the Islamic community itself. Calling for the closure of Islamic schools is bound to court controversy, but it is his contention that Islamic teachings are the causal link to Islamist terrorist acts that seems to really rile community leaders. Following the Manchester bombing, Tawhidi appeared in a fiery TV exchange with Dr. Jamal Rifi, imploring his fellow guest to acknowledge that the Islamic holy scripture  teach(es) the beheading of people .Perhaps Tawhidi is just the kind of person America, and the know-it-all liberals in European nations, who are being overrun by Islamic extremists posing as immigrants, need to be listening to, and perhaps next time, they might want to consider taking his warnings seriously ","label":1},"truncated_cells":[]}],"num_rows_total":44898,"num_rows_per_page":100,"partial":false}